{
  "Tool Name": "Noriben",
  "Speakers": [
    "Brian Baskin"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-US-15",
  "Github URL": "https://github.com/Rurik",
  "Description": "Noriben is an open-source system monitoring tool that allows for quick and simplified tracking of malware activity. By wrapping its operation around Microsoft SysInternals Process Monitor, Noriben uses a comprehensive set of filters to generate very succinct reports that provide the required indicators to create Indicators of Compromise (IoC) alerts.Requirements:- Windows-based system with SysInternals Procmon.exe- Python 2.7.9 or 3.x.- Optional Python Requests and a VirusTotal public API key for VT lookups- Optional Python lib-yara for automated Yara scanningNoriben takes large volumes of system activity and filters out the background noise of system activity and legitimate operations. By focusing solely on important API calls, for file creation, registry operations, and network connections, Noriben creates a simple and straightforward report that features only the indicators that a security analyst or malware analyst cares about. Along with collecting indicators, Noriben will process all created or modified files through a collection of provided Yara signatures and detail any results. It will also submit any file hash to VirusTotal to collect its virus score.As Noriben runs in the background during live operation, it is also suitable to acquire activity while malware is being actively debugged by an analyst. This allows for the collection of artifacts not found during normal operation in standard sandboxes.Within 60 seconds an analyst can get a good handle on a malware's capability and determine if it's a new variant of a known family or something completely new and requiring reverse engineering. Noriben is currently in sophomore stages of development and is deployed in a number of malware analysis labs, including those run by federal law enforcement agencies and defense contractors, relying on its output simplicity to help analysts create actionable intelligence.",
  "Year": "2015",
  "Location": "USA"
}