{
  "Tool Name": "CyberChef-like Automation within BurpSuite - Let's get cooking with CSTC",
  "Speakers": [
    "Florian Haag",
    "Matthias Göhring"
  ],
  "Tracks": [
    "Arsenal Lab",
    "Web AppSec"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Imagine GCHQ's CyberChef integrated in BurpSuite with live modification of requests at your fingertips. That's exactly what we had in mind when we built the Cyber Security Transformation Chef (CSTC) a few years ago. The CSTC is an extension to the popular BurpSuite Proxy built for experts working with web applications. It enables users to define recipes that are applied to outgoing or incoming HTTP requests/ responses automatically. Whatever quirks and specialties an application might challenge you with during an assessment, the CSTC has you covered. Furthermore, it allows to quickly apply custom formatting to a chosen message, if a more detailed analysis is needed.\n\nAs an example, imagine an API that requires an HMAC appended to all messages derived from datapoints inside the message body. With the CSTC you can extract the necessary datapoints with ease and calculate the HMAC on the fly. Together with the CSTCs integration into all major BurpSuite components you can now perform automatic intrusion tests with the Scanner, or manual fuzzing using Intruder and Repeater, without worrying about the HMAC any longer. Another use case is to extract JWTs from incoming HTTP responses and use them in outgoing requests of the Scanner. This eliminates the need to worry about expiring JWTs while scanning.\n\nAfter a few years of silence since the initial release at BlackHat 2020, the CSTC is finally back! It contains new features and improvements such as many new operations to be used in recipes, inclusion of community requested features and a refactoring of the codebase. Alongside the CTSC we will launch a new public repository with recipes we found useful in our experience as penetration testers and of course open for contribution by the community. This helps the community to solve common challenges and getting started working with the CSTC.",
  "Year": "2024",
  "Location": "USA"
}