{
  "Tool Name": "DOLOS-T (Deceptive Operations: Lure, Observe, and Secure Tool)",
  "Speakers": [
    "Federico Pacheco",
    "Joaquin Lanfranconi",
    "Diego Staino"
  ],
  "Tracks": [
    "Network Defense",
    "Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "DOLOS-T (named after Dolos, the Greek god of deception) is an orchestration platform for cyber deception operations that allows deploying realistic high and medium interaction decoys and services to detect threats in the operational infrastructure. It can be deployed in a remote or local environment, and through network traffic redirections, it allows the services to appear to be deployed locally. This enables implementation of deception strategies even in critical production environments with an acceptable level of risk and exposure. The goal is to create realistic environments to detect the target as a decoy. The main strategy is not to hide the service as a decoy, but to detect anomalous behavior early within the environment.\n\nFeatures:\n-Creation of objects that model the goals, storytelling, and context for cyber deception operations and define decoy services with realistic information.\n-Automated deployment of decoys with fake user-provided data to create confusion, increase ambiguity, and detect attackers early.\n-Breadcrumb and honeytoken tracking panel to support a realistic story.\n-Dynamic environments generation that can be easily deployed, discarded, or redefined.\n-Centralized log collection to monitor decoy usage activity.\n-IoCs from collected logs for attacker engagement.\n-Mutation mechanisms to make changes to the environment, such as new services based on detection, self-destruction, and modification of decoy container resources.\n-Guidance panel to track design, definitions, and decisions, which helps manage the operations lifecycle.\n-First open-source tool of its kind.\n\nThe tool is based on our research paper that will be presented at the IEEE ARGENCON 2024 academic conference, titled \"Proposal for the implementation of minimalistic cyber deception strategies\" (preprint available at IEEE TechRxiv and ResearchGate, DOI: http://dx.doi.org/10.13140/RG.2.2.34289.29289).\n\nUse cases:\n-Application server and backend\n-Workstations and internal services\n-VPN type access.",
  "Year": "2024",
  "Location": "USA"
}