{
  "Tool Name": "Winbindiff: Automated Windows Patch Diffing",
  "Speakers": [
    "John McIntosh"
  ],
  "Tracks": [
    "Reverse Engineering",
    "Vulnerability Assessment"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Winbindiff: Automated Windows Patch Diffing\n\nWindows is one of the most widely used operating systems in the world, and also one of the most frequently updated. Every month on Patch Tuesday, Microsoft releases feature and security updates that fix bugs and vulnerabilities in Windows binaries. However, these updates often lack detailed information about the nature and severity of the vulnerabilities, leaving security researchers and system administrators in the dark about the risks and implications of the patches.\n\nEnter Winbindiff, a unique command-line tool designed to shine light on the obscured changes in Windows binaries post-update via automated patch diffing. Patch diffing is a technique that compares the patched and unpatched versions of binaries to reveal what was really fixed for a security update. Winbindiff harnesses the power of Winbindex, a web service that provides an index of Windows binaries, and Ghidriff, a Ghidra fueled Python Diffing Engine to automate the patch diffing process.\n\nWinbindiff can automatically find, download, and compare the binaries for a Windows release build. By automating this process, Winbindiff empowers security professionals to swiftly identify, download, and dissect any Windows update. The result? A comprehensive markdown report detailing the diffing outcomes that we like to call a binary biography or \"binography\". These \"binographies\" tell the story of a binary over time and reveal critical security changes for an update.\n\nOur presentation will introduce Winbindiff and its pivotal role in demystifying Windows updates. Attendees will witness firsthand how this tool can streamline their security analysis, providing a deeper understanding of each update's impact. Join us to explore how Winbindiff is revolutionizing patch diffing and transforming the way we perceive and react to Windows security updates.",
  "Year": "2024",
  "Location": "USA"
}