{
  "Tool Name": "Arsenal Theater Demo: Highway to the Danger Drone",
  "Speakers": [
    "Francis Brown",
    "Dan Petro",
    "David Latimer"
  ],
  "Tracks": [
    "Track: Hardware / Embedded"
  ],
  "Event": "BH-US-16",
  "Github URL": "https://gist.github.com/williballenthin/28c73da6cbf5e76e137a9100ab45697f",
  "Description": "Do you feel the needâ\u0080¦ the need for speed? Then check out our brand new penetration testing drone. This Raspberry Pi based copter is both cheap and easy to create on your own, making it the first practical drone solution for your pentesting needs. Drones have emerged as the prevailing weapon of choice in modern warfare, so it's only logical that we'd also explore the potential applications of this formidable tool in cyber warfare. While there have been presentations before on weaponizing drones for the purposes of pentesting, these efforts were not easily replicated by anyone other than experienced drone aficionados with several thousands of dollars to spend â\u0080\u0093 ultimately resulting in somewhat clunky, partial solutions. Conditions have finally matured enough to where pentesters who are inexperienced with drones can get up and running fairly quickly and spending only a couple hundred dollars on a Raspberry Pi based drone copter solution. Our talk will be aimed at this target audience, helping equip pentesters with drone tools of the future.In this talk, we'll demonstrate how this drone can be used to perform aerial recon, attack wireless infrastructure and clients, land on a target facility roof, and serve as a persistent backdoor. In fact, we'll show you how to attack 'over the air' protocols such as RFID, ZigBee, Bluetooth, Wi-Fi, and more. We'll even demo a special edition \"RickMote Danger Drone\" that you can use to patrol your neighborhood and rickroll Google Chromecast-connected TVs.Additionally, we will showcase the best-of-breed in hardware and software that you'll need. This will include the release of our custom Raspberry Pi SD card image, parts list, 3D print objects, and necessary instructions for you to create a Danger Drone of your own. We'll also be giving away a fully functional Danger Drone to one lucky audience member - guaranteed to leave your friends feeling peanut butter and jealous! This DEMO-rich presentation will benefit both newcomers and seasoned professionals of drone and physical penetration testing fields. Someone better call Kenny Loggins, because you're in the Danger Drone.â\u0080¦No, no boys, there's two 'O's in Bishop Fox.",
  "Year": "2016",
  "Location": "USA"
}