{
  "Tool Name": "FakeNet-NG",
  "Speakers": [
    "Peter Kacherginsky"
  ],
  "Tracks": [
    "Track: Malware Offense"
  ],
  "Event": "BH-US-16",
  "Github URL": "https://github.com/mandiant/flare-fakenet-ng",
  "Description": "FakeNet-NG is a next generation dynamic network analysis tool for malware analysts and penetration testers. FakeNet-NG was inspired by the original FakeNet tool developed by Andrew Honig and Michael Sikorski. FakeNet-NG implements all the old features and many new ones; plus, it is open source and designed to run on modern versions of Windows. FakeNet-NG allows you to intercept and redirect all or specific network traffic while simulating legitimate network services. Using FakeNet-NG, malware analysts can quickly identify malware's functionality and capture network signatures. Penetration testers and bug hunters will find FakeNet-NG's configurable interception engine and modular framework highly useful when testing application's specific functionality and prototyping PoCs. During the tool session attendees will learn the following practical skills:Use FakeNet-NG to mimic common protocols like HTTP, SSL, DNS, SMTP, etc.Configure FakeNet-NG's listeners and interception engine to defeat malware and target specific application functionality.Perform interception on the analysis, secondary or gateway hosts.Use process tracking functionality to identify which processes are generating malicious network activity and dynamically launch services in order to interact with a process and capture all of its network traffic.How to use FakeNet-NG's detailed logging and PCAP capture capabilities.Quickly develop a custom protocol listener using FakeNet-NG's modular architecture. (Includes live malware demo).Bring your Windows analysis Virtual Machine for the demo. The hands-on section of this session will analyze real world malware samples to tease out network-based signatures as well as demonstrate how it can be used to perform security assessments of thick client applications. The challenges start at a basic level and progress until you dive into how to extend FakeNet-NG by writing modules in Python.",
  "Year": "2016",
  "Location": "USA"
}