{
  "Tool Name": "LOG-MD",
  "Speakers": [
    "Michael Gough",
    "Brian Boettcher"
  ],
  "Tracks": [
    "Track: Data Forensics/Incident Response"
  ],
  "Event": "BH-US-16",
  "Github URL": "https://gist.github.com/williballenthin/28c73da6cbf5e76e137a9100ab45697f",
  "Description": "LOG-MD is designed for Windows based systems to audit log and advanced audit policy settings and guide users to enable and configure the audit settings based on industry audit standards like CIS, USGCB, AU ACSC and the 'Windows Logging Cheat Sheets' to help push and encourage moving security and detection of audit logging forward. LOG-MD was also designed to gather the artifacts from malicious activity, referred to as \"Malicious Discovery\", more easily than the standard methods many professionals use today. LOG-MD is designed to speed up the investigation of a suspect system, or help validate it is good, and to speed up evaluating malware in a lab environment.Malicious Discovery is a challenge for many and the Mean Time to Detection (MTTD) from a compromise or worse yet, a breach is still close to a year for most companies. LOG-MD is designed to help small, medium, large, and enterprise businesses improve their Malicious Discovery with a tool that can be run manually or distributed across the environment.LOG-MD replaces or augments several security and forensic tools that have not been updated in years, combing many features professionals rely on, into one easy to use tool. LOG-MD audits the system at each run for audit log related settings, and harvests security related log events. LOG-MD performs hashes of the full filesystem and compares it to a baseline or Master-Digest of trusted files to reduce files that need to be investigated. LOG-MD performs a full baseline of the registry and compares it to a trusted baseline, and searches for special artifacts like the null byte character used in registry keys to hide malware artifacts and large registry keys where malware hides. LOG-MD also harvests PowerShell activity and can harvest optional Sysmon and Windows Logging Service (WLS) events as well for more detailed analysis of system activity. LOG-MD utilizes whitelists to filter down the results of known good and trusted results to make Malicious Discovery easier and faster. In addition LOG-MD can take the artifact details of IP addresses and perform a WhoIs lookup to gain ownership and country information and run files and IP's through VirusTotal for artifact evaluation. Additionally, special artifacts hunting and reporting are being added to LOG-MD as malware authors create them, what we refer to as Malware Management, which is what LOG-MD is based on.",
  "Year": "2016",
  "Location": "USA"
}