{
  "Tool Name": "SIEMonster",
  "Speakers": [
    "Chris Rock"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-US-16",
  "Github URL": "https://github.com/siemonster/docs/blob/master/source/overview.rst",
  "Description": "SIEMonster is a turnkey, open source, enterprise grade, multi node clustered Security Incident and Event Management (SIEM), built on scalable, zero cost components. SIEMonster can be used to immediately identify threats in your organization and used for correlation alert matches over selected periods of time.SIEMonster is the compilation of the best open source framework presentations from Black Hat and DEFCON and developed into a SIEM for all organizations as a viable 'like for like' alternative to commercial SIEM solutions. The product can be rolled out in 15 minutes to an existing organization both locally in the customers Data Center via VM image or Amazon AWS AMI images. SIEMonster comes with supporting build and maintenance documentation that most open source solutions lack.SIEMonster has the following benefits:Fully open source, scalable SIEM in 2,4,8,16 nodes and beyond configurationsNo license restrictions, on node or data limitationsOpen community for additional featuresAlready running in corporate companiesCompletely freeOn-premise hosted security analytics and SIEM open SOC or cloud hostedInstant incident alerting via Dashboard, email, SMS or console view via a secure portal, and integration with Slack/HipChat using Graylog streams.Provides continuous cyber security monitoring to identify, mitigate and respond to internal and external risks in real time using AlertaFull ISMS suite of documentation, including detailed designs, build guides, maintenance instructions, tutorial videos and standard operating procedures, etc.Full integration with OSSEC Wazuh fork for host intrusion detection and PCI DSS ruleset incorporated into ElasticThreat intelligence using open-source OSINT Critical stack and intelligence feeds with no subscription charges.Incorporate your existing vulnerability scans into the dashboard (OpenVas, McAfee, Nessus)Fully automated Open-source incident response ticketing system for incident recording, raising tickets to other operators show the next shift security analysts current issues.",
  "Year": "2016",
  "Location": "USA"
}