{
  "Tool Name": "V3SPA: A Tool for Visually Analyzing and Diffing SELinux Security Policies",
  "Speakers": [
    "Robert Gove"
  ],
  "Tracks": [
    "Track: Code Assessment"
  ],
  "Event": "BH-US-16",
  "Github URL": "https://gist.github.com/williballenthin/28c73da6cbf5e76e137a9100ab45697f",
  "Description": "SELinux policies have enormous potential to enforce granular security requirements, but the size and complexity of SELinux security policies makes them challenging for security engineers and analysts to determine whether the implemented policy meets an organization's security requirements. Furthermore, as system complexity increases, so does the difficulty in assessing differential system modifications without requiring a ground up re-verification. Presently, policy analysts and developers primarily use text-based tools such as sediff, grep, and vi to develop and analyze policies. This can be challenging, however, because policies are often composed of tens or hundreds of thousands of rules, which can be difficult to sift through in text-based tools. Some GUI tools exist, such as apol, but these tools do not incorporate visualizations, which can represent dense information compactly and speed up analysis by offloading cognitive processes to the human visual system. In addition, the GUI tools do not support important tasks such as diffing two versions of a policy.To address the challenges in developing and maintaining SELinux security policies, we developed V3SPA (Verification, Validation and Visualization of Security Policy Abstractions). V3SPA creates an abstraction of the underlying security policy using the Lobster domain-specific language, and then tightly integrates exploratory controls and filters with visualizations of the policy to rapidly analyze the policy rules. V3SPA includes several novel analysis modes that change the way policy authors and auditors build and analyze SELinux policies. These modes include:1. A mode for differential policy analysis. This plugin shows analysts a visual diff of two versions of a security policy, allowing analysts to clearly see changes made. Using dynamic query filters, analysts can quickly answer questions such as, \"What are the changes that affect passwd_t?\"2. A mode for analyzing information flow, identifying unexpected sets of permissions, and examining the overall design of the policy. This plugin allows users to see the entire policy at once, filter down to see only the components of interest, and execute reachability queries both from and to specified domains.As part of our demonstration at Black Hat Arsenal, we will introduce attendees to V3SPA, which we will make freely available online. During our demonstration we will give detailed explanations of V3SPA's algorithms and visualizations, and we will show how V3SPA can be used to assess whether a policy configuration correctly maps to security goals.",
  "Year": "2016",
  "Location": "USA"
}