{
  "Tool Name": "CornerShot: Gaining Foresight in Restrictive Networks",
  "Speakers": [
    "Sagie Dulce"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Legacy internal networks are usually flat, simple for a red team to cut through, and difficult for blue teams to defend. To fix this problem, modern networks apply zero trust access and network segmentation. This new paradigm presents new challenges not only to attackers but to defenders as well.\n\nIn such environments, visibility becomes crucial. Which computers can access others and be viable candidates for lateral movement? This question is certainly troubling attackers and red teams, but also defenders and blue teams looking to identify and defend such key network paths.\n\nCornerShot utilized a novel technique to discover network access between two remote hosts, without requiring privileged access to those hosts. In modern warfare CornerShot is a weapon that allows a soldier to look past a corner (and possibly take a shot), without actually risking exposure. Similarly, the CornerShot capability allows one to look at another hosts' network access non-intrusively, without risking exposure.\n\nCornerShot relies on several, well documented, standard Remote Procedure Call (RPC) methods that are used by various Microsoft services. By using methods that only require a non-privileged authenticated account in the domain, CornerShot is able to trigger network traffic from a destination host to a target. Once traffic is generated, CornerShot is able to determine the remote's port state by measuring the time an RPC call took, and the response it received from the destination host.\n\nWe will demonstrate real world applications, for example: how to scan an entire network access from a single deployment of CornerShot, and how to validate which BloodHound paths are practical given the underlying network access.",
  "Year": "2020",
  "Location": "Europe"
}