{
  "Tool Name": "Botnet Simulation Framework (BSF)",
  "Speakers": [
    "Leon Böck",
    "Shankar Karuppayah",
    "Jens Keim",
    "Emmanouil Vasilomanolakis"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "In the arms race between botmasters and defenders, the botmasters have the upper hand, as defenders have to react to actions and novel threats introduced by botmasters. The Botnet Simulation Framework (BSF) addresses this problem by leveling the playing field. It allows defenders to get ahead in the arms race by developing and evaluating new botnet monitoring techniques and countermeasures. This is crucial, as experimenting in the wild will interfere with other researchers and possibly alert botmasters.\n\nBSF allows realistic simulation of peer-to-peer botnets to explore and study the design and impact of monitoring mechanisms and takedown attempts before being deployed in the wild. BSF is a discrete event botnet simulator that provides a set of highly configurable (and customizable) botnet features including:\n- realistic churn behavior\n- variable bot behavior\n- monitoring mechanisms (crawlers and sensors)\n- anti-monitoring mechanisms\n\nMoreover, BSF provides an interactive visualization module to further study the outcome of a simulation. BSF is aimed at enabling researchers and defenders to study the design of the different monitoring mechanisms in the presence of anti-monitoring mechanisms [1,2,3]. Furthermore, this tool allows the users to explore and understand the impact of design choices of botnets seen to date.\n\n[1] Leon Böck, Emmanouil Vasilomanolakis, Jan Helge Wolf, Max Mühlhäuser: Autonomously detecting sensors in fully distributed botnets. Computers & Security 83: 1-13 (2019)\n[2] Leon Böck, Emmanouil Vasilomanolakis, Max Mühlhäuser, Shankar Karuppayah: Next Generation P2P Botnets: Monitoring Under Adverse Conditions. RAID 2018: 511-531\n[3] https://www.blackhat.com/eu-17/briefings.html#i-trust-my-zombies-a-trust-enabled-botnet",
  "Year": "2020",
  "Location": "USA"
}