{
  "Tool Name": "Cylons: An automated IoT security assessment platform based on OpenWRT",
  "Speakers": [
    "Wei Wang",
    "Jianqiang Wu",
    "Qianwei Hu"
  ],
  "Tracks": [
    "Track: Hardware/Embedded"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Smart/IoT devices these days are all about network, Internet in particular. When a box gets itself connected to the cloud, it exposes lots of attack surface as well. Hence, network assessment plays a fundamental role in IoT SDL (Security Development Lifecycle) practices. We have built a platform which aims to help security engineers to automate some common assessment workloads, black-box testing specifically.\n\nWith the help of OpenWRT, we are freed from wired/wireless network setup work, thus focusing more on traffic monitoring and parsing. Once a device got connected, Cylons can automatically accomplish tasks like:\n- Packet capture, protocol parsing and logging\n- Active port scan and passive port discovery\n- DNS poisoning\n- TCP session reset and injection\n- Simple client fuzzing based on TCP injection\n- TLS MITM Proxy and SNI Proxy, to detect insecure TLS validation\n- TLS security check, to detect outdated ciphersuites, versions and configurations\n- Sensitive strings match over clear-text traffic\n- Generating knowledge graph for network endpoints\n\nApart from these core functions, Cylons also offers some other convenient features, such as RESTful API interface, LuCI-based WebUI and integration of SSL Labs APIs.\n\nPerformance is an inevitable challenge for any network-oriented tools. In order to achieve decent performance without compromising security, Cylons is fully written in Rust, with little \"unsafe\" code. Rust also enables us to easily cross-build for different targets like ARM, AARCH64 and MIPS, which shares the same goals as OpenWRT.\n\nCylons is still in heavy development, we are trying to bring more features and make it more powerful and robust. One major goal is to add support for radio protocol assessments, including WiFi, BLE and Zigbee.",
  "Year": "2020",
  "Location": "USA"
}