{
  "Tool Name": "Deoptfuscator: Automated Deobfuscation of Android Bytecode using Compilation Optimization",
  "Speakers": [
    "Gyoosik Kim",
    "Geunha You",
    "Seong-je Cho"
  ],
  "Tracks": [
    "Track: Reverse Engineering"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Code obfuscation is a technique that makes programs harder to understand. Malware writers widely the obfuscation technique to evade detection from anti-malware software, or to deter reverse engineering attempts for their malicious code. Typical obfuscation techniques applied to Android malicious apps include identifier renaming, string encryption, control-flow obfuscation, and Java reflection (API hiding). If we de-obfuscate the obfuscated code and restore it to the original code before obfuscation was applied, we can analyze the obfuscated malware effectively and efficiently.\n\nTherefore, we have developed Deoptfuscator, an effective tool for de-obfuscating the Android applications that have been transformed using control-flow obfuscation mechanisms. That is, it can reverse the control-flow obfuscation of Android APKs.\n\nThe features of Deoptfuscator are as follows:\n- Deoptfuscator can detect obfuscation traces (especially, opaque predicates) utilizing the optimization approach of Android ART's ahead-of-time (AOT) compiler. It effectively optimizes the control flow of an obfuscated app using ReDex as well as the detected obfuscation traces.\n- If the obfuscated Android app can run on a device, the de-obfuscated app reversed by Deoptfuscator can run on the device too.\n- Deoptfuscator can reverse the control-flow obfuscation techniques of DexGuard that other de-obfuscation tools haven't.\n- If Deoptfuscator is used in conjunction with other de-obfuscators such as DeGuard that can reverse identifier renaming of Android APKs, it can be a more powerful de-obfuscation tool.\n\n\n\nThis research was supported by Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Science and ICT (no. 2018R1A2B2004830)",
  "Year": "2020",
  "Location": "USA"
}