{
  "Tool Name": "Manuka: A modular, scalable OSINT honeypot targeting pre-attack reconnaissance techniques",
  "Speakers": [
    "Eugene Lim",
    "Kee Hock Tan",
    "Bernard Lim",
    "Kenneth Tan"
  ],
  "Tracks": [
    "Track: OSINT - Open Source Intelligence"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Manuka is an Open-source intelligence (OSINT) honeypot that monitors reconnaissance attempts by threat actors and generates actionable intelligence for Blue Teamers. It creates a simulated environment consisting of staged OSINT sources, such as social media profiles and leaked credentials, and tracks signs of adversary interest, closely aligning to MITRE's PRE-ATT&CK framework. Manuka gives Blue Teams additional visibility of the pre-attack reconnaissance phase and generates early-warning signals for defenders.\n\nAlthough they vary in scale and sophistication, most traditional honeypots focus on networks. These honeypots uncover attackers at Stage 2 (Weaponization) to 7 (Actions on Objectives) of the cyber kill chain, assuming that attackers are already probing the network.\n\nManuka conducts OSINT threat detection at Stage 1 (Reconnaissance) of the cyber kill chain. Despite investing millions of dollars into network defenses, organisations can be easily compromised through a single Google search. One recent example was hackers exposing corporate meetings, therapy sessions, and college classes through Zoom calls left on the open Web. Enterprises need to detect these OSINT threats on their perimeter but lack the tools to do so.\n\nManuka is built to scale. Users can easily add new listener modules and plug them into the Dockerized environment. They can coordinate multiple campaigns and honeypots simultaneously to broaden the honeypot surface. Furthermore, users can quickly customize and deploy Manuka to match different use cases. Manuka's data is designed to be easily ported to other third-party analysis and visualization tools in an organisation's workflow.\n\nDesigning an OSINT honeypot presents a novel challenge due to the complexity and wide range of OSINT techniques. However, such a tool would allow Blue Teamers to \"shift left\" in their cyber threat intelligence strategy.",
  "Year": "2020",
  "Location": "USA"
}