{
  "Tool Name": "S-TIP: Seamless Threat Intelligence Platform",
  "Speakers": [
    "Koji Yamada",
    "Toshitaka Satomi",
    "Ryusuke Masuoka"
  ],
  "Tracks": [
    "Track: Data Forensics/Incident Response"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "S-TIP is an open-source platform for those who analyze threats and share the results with CSIRT etc.\n\nThere are a variety of CTI (Cyber Threat Intelligence) in the world. \"Human CTI\" is knowledge of cyberattacks to be consumed by people through social media, email, and other channels. \"System CTI\" is cyber attack-related knowledge that is consumed by systems in a format that can be understood by computers, namely STIX.\n\nHowever, there were barriers between Human CTI and System CTI. There were divided and could not be utilized from the other realm. For example, security operators need intensive manual labor to convert a new threat report for human readers into CTI in a machine-readable format for automated defense.\n\nS-TIP solves this problem by integrating Human CTI and System CTI seamlessly through its STIX database to bring down those barriers. When a user creates a new post, it is automatically converted to the STIX file and saved into the database. The system can trigger automated defense by consuming the STIX file. These processes can be done transparently while a user is unaware of the conversion.\n\nMain features of S-TIP are:\n1. CTI Element Extractor: Human posts to the social media UI of S-TIP are automatically captured as STIX data.\n2. CTI Graph Analytics View: The STIX data can be associated with other pieces of CTI. This mechanism makes it much easier for users to grasp the whole picture of the cyberattack quickly.\n3. Integration with Other Platforms: The STIX data can be readily consumed by security tools like MISP, Splunk, JIRA, and Slack.\n4. STIX/TAXII - Compliant: Collects CTI from open STIX / TAXII servers on the Internet like AlienVault OTX.\n\nThese features support a more predictive and proactive response.\n\nAvailable at : https://github.com/s-tip",
  "Year": "2020",
  "Location": "USA"
}