{
  "Tool Name": "vPrioritizer: Learn to say NO to almost every vulnerability (art of risk prioritisation…)",
  "Speakers": [
    "Pramod Rana"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/varchashva",
  "Description": "As suggested by vulndb and cve, on a daily basis, approximately 50 new vulnerabilities become known to industry and even if an organization considers the impact rate of 10%, it’s still very challenging to manage it effectively and it’s safe to assume that count is going to increase furthermore. So with this amount organization is focusing (or should focus) on reducing the risk rather than eliminating it.\n\nIn current era, vulnerability management is (almost) equal to risk prioritisation because\n\n- Resources (skillset and time) is limited in every organisation\n- Environment is changing too fast and too frequently (ROI is less in analysis and remediation of a vulnerability if affected asset is not going to be live for a longer time - small attack surface)\n- Attack surface is increasing exponentially in diversity (which again comes down to prioritisation)\n- Remember the 80/20 rule - 20% of vulnerabilities bring 80% of risk\n\nSo what is risk? How do we calculate it? What are the factors contributing to risk?\n\n1. CVSS (historically used) - No\n2. Asset Criticality - No\n3. Asset Accessibility - No\n4. Exploit Applicability - No\n5. Exploit Availability - No\n6. Ease of Exploitation - No\n7. Attack Surface - No\n8. All of the Above - Yes\n\nTheoretically, the above approach looks appropriate to adopt but practically it’s not possible to do it manually for every vulnerability affecting every asset by every organisation.\n\nTo overcome the above challenges I have prepared an open-source framework, vPrioritizer, which gives us ability to assess the risk on different layers such as (and hence comprehensive control on granularity of each component of risk):\n\n- We can assign significance on per asset basis\n- We can assess severity on per vulnerability basis\n- At the same time, we can adjust both factors at asset & vulnerability relationship level\n- On top of that, community analytics provides insights as suggested risk\n\nThis framework enables us to understand the contextualized risk pertaining to each asset by each vulnerability across the organization. It’s community based analytics provides a suggested risk for each vulnerability identified by vulnerability scanners and further strengthens risk prioritization process. So at any point of time teams can make an effective and more informed decision, based on unified and standardized data, about what (vulnerability/ties) they should remediate (or can afford not to) on which (asset/s).",
  "Year": "2020",
  "Location": "USA"
}