{
  "Tool Name": "FLARE VM",
  "Speakers": [
    "Peter Kacherginsky"
  ],
  "Tracks": [
    "Track: Reverse Engineering"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://gist.github.com/gabemarshall/cec452231db177f551599cd75df6268a",
  "Description": "Have you ever needed to rapidly create a Windows VM with all your analysis tools? Do you get annoyed by constantly having to update each and every security tool to the latest version in you VMs? Has your VM been not updated or patched for years on end? If you answered yes to any of these questions, then you NEED the FLARE VM.\n\nFLARE VM is the first of its kind freely available and open sourced Windows-based security distribution designed for reverse engineers, malware analysts, incident responders, forensicators, and penetration testers. Inspired by open-source Linux-based security distributions like Kali Linux, FLARE VM delivers a fully configured platform with a comprehensive collection of Windows security tools such as debuggers, disassemblers, decompilers, static and dynamic analysis utilities, network analysis and manipulation, web assessment, exploitation, vulnerability assessment applications, and many others.\nFLARE VM comes in two flavors – Malware Analysis and Penetration Testing editions. Each edition targets a specific task. For example, FLARE VM - Malware Analysis Edition is optimized for and contains tools specifically for reverse engineering malware. The tools included with FLARE VM distribution were either developed or carefully selected by the members of the FLARE (FireEye Labs Advanced Reverse Engineering) Team who have been reverse engineering malware, analyzing exploits and vulnerabilities, and teaching malware analysis classes for over a decade.\n\nThe security distribution works as an easily deployable package that you can install on an existing Windows installation. FLARE VM brings a familiar, easy to manage package management system to quickly deploy and customize the platform to suite your specific needs. After the initial installation, you can easily add, remove and update packages in the FLARE VM package repository.\n\nDuring the session attendees will be familiarized with different tools, plug-ins and scripts offered on the FLARE VM to do the following:\n\nHow to go from a basic Windows installation to a fully deployed FLARE VM ready to analyze malware and conduct security assessments in 30 minutes or less.\nPerform basic static analysis of a real malware sample to gather basic indicators.\nRun the malware sample in a safe manner in order to manually gather dynamic indicators by simulating a complete network environment and carefully observing malware behavior with a variety of tools and techniques.\nDeep dive into malware inner workings by using a number of disassemblers and decompilers available on the system.\nAdvanced dynamic analysis and generic unpacking techniques using debuggers, various plugins, and other tools that come with the distribution.\nLearn how to customize the VM, create new packages and your own custom editions using the FLARE VM package repository.\n\nBring a Windows 7+ Virtual Machine to easily participate in the hands-on section of the demo.",
  "Year": "2017",
  "Location": "USA"
}