{
  "Tool Name": "GAME OF DRONES: PUTTING THE EMERGING 'DRONE DEFENSE' MARKET TO THE TEST - ARSENAL THEATER DEMO",
  "Speakers": [
    "David Latimer",
    "Francis Brown"
  ],
  "Tracks": [
    "Track: Hardware/Embedded"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://gist.github.com/williballenthin/28c73da6cbf5e76e137a9100ab45697f",
  "Description": "When you learned that military and law enforcement agencies had trained screaming eagles to pluck drones from the sky, did you too find yourself asking: \"I wonder if I could throw these eagles off my tail, maybe by deploying delicious bacon countermeasures?\" Well, you'd be wise to question just how effective these emerging, first generation 'drone defense' solutions really are, and which amount to little more than 'snake oil.'\n\nThere is no such thing as \"best practices\" when it comes to defending against 'rogue drones' – period. Over the past 2 years, new defensive products that detect and respond to 'rogue drones' have been crawling out of the woodwork. The vast majority are immature, unproven solutions that require a proper vetting.\n\nWe've taken a MythBusters-style approach to testing the effectiveness of a variety of drone defense solutions, pitting them against our DangerDrone. Videos demonstrating the results should be almost as fun for you to watch as they were for us to produce. Expect to witness epic aerial battles against an assortment of drone defense types, including:\n\nTrained eagles and falcons that hunt 'rogue drones'\nFighter drones that hunt and shoot nets\nDrones with large nets that swoop in and snatch up 'rogue drones'\nSurface-to-air projectile weapons, including bazooka-like cannons that launch nets, and shotgun shells containing nets\nSignal jamming and hijacking devices that attack drone command and control interfaces\nEven frickin' laser beams and Patriot missiles!\n\nWe'll also be releasing DangerDrone v2.0, an upgraded version of our free Raspberry Pi-based pentesting quadcopter (basically a ~$500 hacker's laptop… that can also fly). We'll be giving away a fully functional DangerDrone v2.0 to one lucky audience member! Come see what's guaranteed to be the most entertaining talk this year and find out which of these dogs can hunt!",
  "Year": "2017",
  "Location": "USA"
}