{
  "Tool Name": "NEEDLE",
  "Speakers": [
    "Marco Lancini"
  ],
  "Tracks": [
    "Track: Android",
    "iOS and Mobile Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/WithSecureLabs/needle",
  "Description": "Needle (github.com/mwrlabs/needle) is the MWR's iOS Security Testing Framework, released at Black Hat USA in August 2016. It is an open source modular framework which aims to streamline the entire process of conducting security assessments of iOS applications, and acts as a central point from which to do so. Given its modular approach, Needle is easily extensible and new modules can be added in the form of python scripts. Needle is intended to be useful not only for security professionals, but also for developers looking to secure their code. A few examples of testing areas covered by Needle include: data storage, inter-process communication, network communications, static code analysis, hooking and binary protections. The only requirement in order to run Needle effectively is a jailbroken device.\n\nWith the release of Needle v1.0.0, we provided a major overhaul of its core and the introduction of a new native agent, written entirely in Objective-C. The new NeedleAgent (https://github.com/mwrlabs/needle-agent) is an open source iOS app complementary to Needle, that will allow it to programmatically perform tasks natively on the device, eliminating the need for third party tools.\n\nThe agent, already available for download on Cydia, will (over time) allow Needle to:\n\nProvide transparent support for iOS 10 and future versions\nRemove all dependencies required now\nProvide a platform that will enable security testing on non-jailbroken devices\n\nThe tool's architecture, capabilities and road-map will be described. A demonstration will also be performed of how Needle can be used to find vulnerabilities in iOS applications from both a black-box and white-box perspective (if source code is provided).",
  "Year": "2017",
  "Location": "USA"
}