{
  "Tool Name": "OSRFRAMEWORK: OPEN SOURCES RESEARCH FRAMEWORK",
  "Speakers": [
    "Félix Brezo Fernández",
    "Yaiza Rubio Viñuela"
  ],
  "Tracks": [
    "Track: OSINT - Open Source Intelligence"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/CrackerCat/GitHubLinks",
  "Description": "OSRFramework is a GNU AGPLv3+ set of libraries modularly developed by Yaiza Rubio and Félix Brezo to perform Open Source Intelligence tasks. In the framework, the authors include a series of applications related to username checking, DNS lookups, social media research, regular expressions extraction and many others. At the same time, by means of ad-hoc Maltego transforms, OSRFramework provides a way of making these queries graphically as well as including other interfaces to interact with it using the command line and a web server.\n\nThe most important tools included in the framework are:\n\nusufy.py. Application focused on checking the existence of different usernames in up to 309 platforms (as May 4th, 2017).\ndomainfy.py. Application focused on finding existing domains and common subdomains that currently resolve to IP addresses (more than 1500 possible domains checked). Whois information is retrieved when possible.\nmailfy.py. Application that validates the existence or not of an email account in more than 20 different email providers.\nOther tools included are: alias_generator.py, phonefy.py and searchfy.py as well as osrfconsole.py (msfconsole-like command line GUI), osrframework_server.py (a Web interface that includes an API) and several local Maltego transforms and entities.\nAmongst the capabilities included, it is possible to export to several formats (.csv, .xls, .xlsx, .gml, etc.), to configure the number of threads and proxy settings and to define the credentials to be used if the forum enforces it.\n\nAs each security analyst may be facing different information needs, the tool has been conceived to be easily configurable so as to include new local sources. By means of plugins that analysts can add locally using the templates provided by the authors, security researchers will be able to adapt the tool to his/her own specific needs at any time.",
  "Year": "2017",
  "Location": "USA"
}