{
  "Tool Name": "Democratizing Attack Techniques in the Cloud withThe DeRF",
  "Speakers": [
    "Kat Traxler"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "DeRF (Detection Replay Framework) is an \"Attacks As A Service\" framework, allowing the emulation of offensive techniques and generation of repeatable detection samples from a UI - without the need for End Users to install software, use the CLI or possess credentials in the target environment.\n\nNotable built-in attack modules are listed below with a complete list of all built-in attack techniques in The DeRF documentation.\n\no AWS | EC2 Steal Instance Credentials\no AWS | Retrieve a High Number of Secrets Manager secrets.\no AWS | Stop CloudTrail\no AWS | Execute Commands on EC2 Instance via User Data\no AWS | EC2 Download User Data\no AWS | EC2 Share EBS Snapshot\no GCP | Impersonate Service Account\n\nSimilar to other tools focused on detection generation, the DeRF deploys and manages the target cloud infrastructure, which is manipulated to simulate attacker techniques.\nTerraform is used to manage all resources, deploying (and destroying) hosted attack techniques and target infrastructure in under 3 minutes.\n\nWhile a bring-your-own-Infrastructure (BYOI) model isn't currently supported, maintaining The DeRF infrastructure costs less than $10/month for Google Cloud and $5/month for AWS. The tool's convenient deployment model means you can use it as needed rather than continuously running 24/7. Check out the deployment guide for more details.\n\nThe initial release of The DeRF encompasses a wide range of prevalent cloud attack techniques, providing your organization with ample resources for training, controls testing, and executing on attack scenarios. However, as needs evolve, you may need to expand beyond the initial set and introduce your own custom attack modules. With The DeRF, this process is simplified. All attack techniques are defined as Google Cloud Workflows, which can be deployed as additional terraform modules within your forked version of the codebase.",
  "Year": "2023",
  "Location": "Europe"
}