{
  "Tool Name": "Route53Sweep: Empowering AWS Route53 Security with Automated Scanning & Comprehensive Inventory Management",
  "Speakers": [
    "Divyanshu Shukla",
    "Anjali Singh Shukla"
  ],
  "Tracks": [
    "Network Attacks",
    "Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Route53Sweep uses the AWS Route53 service to improve the management of Route53 security providing a innovative solution to DNS Security. AWS Route53-managed resources like domains, subdomains, DNS records, and related services are all secured and protected by this, which also adopts a comprehensive approach to DNS security management. Organizations can easily track changes to their AWS Route53 resources with Route53Sweep, as well as automate procedures for scanning public IPs and fixing them. Organizations can increase their security and dependability with Route53Sweep, freeing them up to concentrate on other important business operations.\n\nKey Topics:\n\nAddressing the Urgent Need: We investigate the escalating security issues surrounding AWS Route53 and the necessity of specialized scanning software like Route53Sweep. To protect organizations from potential threats, we emphasize the value of ongoing monitoring and keeping a complete inventory of Route53 assets.\n\nRoute53Sweep Unleashed: Learn more about our cutting-edge tool's inner workings and how it effectively makes use of a variety of open source tools such as the Nuclei engine, Anew, Httpx, and Notify. The combination of these open-source components with Route53Sweep improves vulnerability scanning capabilities and makes asset discovery and monitoring in real time easier.\n\nA Unique Approach: We are proud of our \"Desi Jugaad\" spirit, which embodies ingenuity and resourcefulness. This idea is embodied by Route53Sweep, which offers an unusual but effective way to automate AWS Route53 security management. Our tool ensures user friendliness while streamlining scanning, automating inventory management, and reducing common security issues.\n\nMitigating Critical Security Issues: Learn how Route53Sweep handles important security issues like NXDomain, Subdomain Takeovers & External Vulnerability Scanning. We demonstrate how our tool enables businesses to proactively address these issues and fortify their security defenses.\n\nReal-Time Alerting with Slack: Take a glimpse at the power of Slack integration, which enables real-time alerting for discovered assets and vulnerabilities. Organizations are kept informed and ready to act quickly in case of threats thanks to Route53Sweep.\n\nLive Demonstration: It presents a interactive, live demonstration of Route53Sweep in use. Discover how the tool manages AWS Route53 assets, identifies vulnerabilities, and performs all of these tasks in a simple and effective way.",
  "Year": "2023",
  "Location": "Europe"
}