{
  "Tool Name": "Cloud Security Suite: One-Stop Tool for AWS/GCP/Azure Security Audit",
  "Speakers": [
    "Jayesh Chauhan"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/jayeshchauhan",
  "Description": "Nowadays, cloud infrastructure is pretty much the de-facto service used by large/small companies. Most of the major organizations have entirely moved to cloud. With more and more companies moving to cloud, the security of cloud becomes a major concern.\n\nWhile AWS, GCP & Azure provide you protection with traditional security methodologies and have a neat structure for authorization/configuration, their security is as robust as the person in-charge of creating/assigning these configuration/policies. Also, the massive scale at which cloud services are adopted in enterprises, merged with inevitability of human error, often leads to catastrophic damages to the business.\n\nFew vulnerable scenarios:\n\nSecurity groups/policies, password policy or IAM policies are not configured adequately\nS3 buckets and Azure blobs are world-readable\nWeb servers are supporting vulnerable SSL ciphers\nPorts exposed to public with vulnerable services running\nIf root credentials are used\nLogging or MFA is disabled\nAnd many more such scenarios...\n\nKnowing all this, audit of cloud infrastructure becomes a hectic task! There are a few open source tools which help in cloud auditing however none of them provides an exhaustive checklist. Also, setting up all the tools and looking at different result sets is a redundant task. While managing massive infrastructures, system audit of server instances is a challenging task as well.\n\nCS Suite is a one stop tool for auditing the security posture of the AWS/GCP/Azure infrastructures along with server audit feature. CS Suite leverages capabilities of current open source tools and has plethora of custom checks into one tool to rule them all.",
  "Year": "2019",
  "Location": "USA"
}