{
  "Tool Name": "PowerShell-RAT",
  "Speakers": [
    "Viral Maniar"
  ],
  "Tracks": [
    "Track: Malware Offense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/Viralmaniar/Powershell-RAT/actions",
  "Description": "PowerShell-RAT is a stealthy tool which exfiltrates sensitive information from the Windows environment through screenshots and keystrokes. The exfiltrated information is sent to a malicious user over a HTTPS protocol in the form of email attachments. The RAT can be invoked with a single key press using 'Hail Mary' option. Gmail is used to receive files from the backdoored machine. As Gmail is considered one of the highly trusted domains, this would allow an attacker to avoid network detection by NextGen Firewalls.\n\nDuring a Red Team engagement, this tool can be executed on any Windows machine which backdoors the user machine using a number of task schedulers which will run the PowerShell scripts. Once backdoored, malicious user receives screenshots of the user activities via email every 5 minutes. After the email is received, screenshots are deleted from the machine to clean up the disk space, hence, avoiding the detection.\n\nOn successful authentication on a Windows machine, backdoor triggers the keystroke module on the user machine. It saves every key press via keyboard in the \"log.txt\" file on the user machine and sends it to the malicious user every hour as an email attachment. Setup requires a dedicated throw away Gmail account with modification to PowerShell script credential variables and a malicious user needs to enable \"Allow less secure apps\" under the security settings of the Gmail account to receive screenshots and key logs from the backdoored machine.\n\nTarget system can be identified using attachments naming convention which is Computer name followed by the timestamp. The backdoor Python file can be converted into an executable using Pyinstaller. During demo, I would also walk through a number of defence mechanisms to detect stealthy backdoors using publicly available tools such as Sysinternals from Microsoft.",
  "Year": "2019",
  "Location": "USA"
}