{
  "Tool Name": "PyRDP: Python 3 Remote Desktop Protocol Man-in-the-Middle (MITM) and Library",
  "Speakers": [
    "Francis Labelle",
    "Émilio Gonzalez"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "PyRDP is an RDP man-in-the-middle tool that has applications in pentesting and malware research. On the pentesting side, PyRDP has a number of features that allow attackers to compromise RDP sessions when combined with TCP man-in-the-middle solutions. If network-level authentication (NLA) is not enforced on an organization's RDP servers, attackers can use PyRDP to take complete control of RDP sessions. The graphical interface shows the client's credentials, keystrokes and clipboard contents as well as the current screen. It also has a \"take control\" button that allows attackers to hijack sessions. While the attacker is in control, all output going to the client is blocked to hide malicious activity. PyRDP also lists the contents of the drives mapped by the clients and allows attackers to download files from them. Finally, attackers can configure the man-in-the-middle to automatically run payloads on new connections. These payloads can be console commands or PowerShell scripts, and are hidden from the clients. Attackers can make use of PyRDP even when NLA is enforced by redirecting traffic to their own virtual machine. This setup allows them to collect credentials and use the functionalities for stealing clipboard contents and files.\n\nOn the malware research side, PyRDP can be used as part of a fully interactive honeypot. It can be placed in front of a Windows RDP server to intercept malicious sessions. It has the ability to replace the credentials provided in the connection sequence with working credentials to accelerate compromise and malicious behavior collection. It also saves a visual and textual recording of each RDP session, which is useful for investigation. Additionally, PyRDP saves a copy of the files that are transferred via the drive redirection feature, allowing it to collect malicious payloads. This accelerates malware analysis since there is no need to search for the payloads on the infected machines or in the network activity.",
  "Year": "2019",
  "Location": "USA"
}