{
  "Tool Name": "Real-Time Detection Tool of High-Risk Attacks Leveraging Kerberos and SMB",
  "Speakers": [
    "Mariko Fujimoto",
    "Wataru Matsuda",
    "Takuho Mitsunaga"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "In Advanced Persistent Threat (APT) attacks, attackers tend to attack against the Active Directory. Especially vulnerabilities fixed in MS14-068 and MS17-010 have been leveraged to get administrator privileges. Attackers who can get administrator privileges likely create \"Golden Ticket\" and \"Silver Ticket\" to disguise themselves as arbitrary administrative accounts for a long period. However, detecting these attacks is quite difficult since legitimate accounts and processes are leveraged. Since sometimes attackers successfully accomplish lateral movement in a short period, immediate detection is needed.\n\nWe will introduce a real-time detection tool for the following attack activities against Active Directory using Event logs and Kerberos packets.\n-Attacks leveraging the vulnerability fixed in MS14-068 and MS17-010\n-Attacks using Golden Ticket\n-Attacks using Silver Ticket\n\nWe introduced the detection tool for Golden Ticket from Event Logs in Black Hat Europe 2018, but sometimes false positive occurs because of the Kerberos specification. In this time, we introduce the improved tool. The detection rate is improved, and introduce a new feature to detect Silver Ticket attacks.\n\nOur tool can detect attacks against Windows 2008 R2, 2012, 2016. Additionally, our tool utilizes only Domain Controller's built-in Event Logs and minimum Kerberos packets. Thus, it can be implemented in easy way and helps immediate incident response.\n\nFinally, ATT&CK, a knowledge base of adversary tactics and techniques, is becoming common recently. The tool can identify the possible tactics for each detected attack activity automatically.\n\nSource code: https://github.com/sisoc-tokyo/Real-timeDetectionAD_ver2",
  "Year": "2019",
  "Location": "USA"
}