{
  "Tool Name": "Spartacus as a Service (SaaS): Privacy via Obfuscation",
  "Speakers": [
    "Mike Kiser"
  ],
  "Tracks": [
    "Track: OSINT - Open Source Intelligence"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "The Third Servile War was over. The slave army has been defeated, and the survivors are offered a pardon by their Roman captors. The only requirement was that they identify Spartacus, their leader (Kirk Douglas). Rather than give away his identity, however, they all begin to yell out \"I'm Spartacus!\"—thus preserving his anonymity by overwhelming the Romans with possibilities. (Spoiler alert: they all die as a result.)\n\nSince users cannot rely on governments to ensure privacy, a different method of privacy assurance is proposed: privacy through obfuscation.\n\n\"Spartacus as a Service (SaaS)\" is an open-source proof-of-concept is introduced that facilitates these obfuscation techniques. This will allow for automatic obfuscation of a chosen identity on a small scale, and lessons learned from its usage will be discussed.\n\nAdditional information:\n\nCurrent version at: https://github.com/derrumbe/Spartacus-as-a-Service\nOpen-source tool written largely in Node.js under an MIT license\nDevelopment is ongoing, and this is expected to be a long-term project (first official release would coincide with BlackHat/DefCon)\nAuthorization for obfuscation is done via OAuth for a signed in user (explicit consent is therefore given)\nAdditional resources have been incorporated to accommodate this content. A Markov chain is used to generate new content based on a textual repository (ranging from political platforms to the oft-used Jane Austen canon to Aaron Franklin's book on BBQ (he's a big deal here in Austin.)) Amazon Mechanical Turk may be used to circumvent bothersome pieces such as captchas.\nNote that this is not a tool that *prevents* targeted advertising and the like, instead it seeks to dilute the value of information that companies know about a user, masking the true information from the fake, so that it is impossible to tell what the real content (or in some cases, who the person) actually is.",
  "Year": "2019",
  "Location": "USA"
}