{
  "Tool Name": "AutoSuite: An Open-Source Multi-Protocol Low-Cost Vehicle Bus Testing Framework",
  "Speakers": [
    "Mingming Wan",
    "Zhongyu Wang",
    "Xingcan Chen"
  ],
  "Tracks": [
    "Hardware / Embedded",
    "Smart Grid/Industrial Security"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Vehicle buses such as FlexRay, LIN, CAN (FD) and Ethernet are the cornerstones of ECUs communication. At present, the security research of vehicle buses mainly focuses on CAN Bus. Due to the characteristics of the protocol itself, CAN data is usually transmitted within the domain. while Flexray is often used as a backbone network connecting powertrain control, autonomous driving, and body control domains for cross-domain communication and transmission of critical data.\nIt is commonly used in high-end brands such as Audi, Lotus, and BMW. However, security research on Flexray is still in its infancy.\n\nWe will present AutoSuite, an open-source, multi-protocol, low-cost vehicle bus testing framework, consisting of the AutoBox(hardware) and AutoFunc (software). AutoSuite can be used to access the FlexRay bus and simulate malicious ECUs to send forged data to realize cross-domain ECU attacks and discover potential security vulnerabilities.\n\nAutoBox is probably the first open-source, multi-protocol, low-cost vehicle bus testing hardware that support FlexRay. It can automatically analyze FlexRay bus configuration parameters, join the cluster, and send malicious data on the FlexRay bus. The hardware cost is about $200, which is much lower than the commercial FlexRay bus testing tool Vector VN8910 ($50k). AutoBox also supports remote control, multiple device collaboration, and Ethernet, LIN, and CAN (FD) protocols. AutoBox will provide a friendly, open-source, and low-cost testing tool for vehicle bus researchers, much like HACKRF has become a low-cost alternative to USRP.\n\nAutoFunc may be the first open-source software for functional-level communication testing and functional-level fuzzing that supports condition monitoring. Current open-source vehicle bus testing methods mainly rely on random fuzzing of the CAN protocol by using random data frame IDs, payloads, and DLC. However, a vehicle function typically involves multiple data frames, and a single data frame may not have any impact on the bus. With opendbc and other open-source projects, the .dbc file is no longer a commercial secret. AutoFunc can organize the frames defined in the .dbc file into specific functions, and monitor the function where the crash occurs to achieve a multi-protocol fuzzing test.\n\nIn addition, we will show 2 demos,\n(1) Demonstrate all functions supported by AutoBox, such as FlexRay, CAN, LIN, Ethernet, WiFi, etc.\n(2) Functional-level fuzzing using AutoBox and AutoFunc.",
  "Year": "2023",
  "Location": "USA"
}