{
  "Tool Name": "Identity Threat Hunting with Kestrel",
  "Speakers": [
    "Paul Coccoli",
    "Sulakshan Vajipayajula",
    "Ritesh Kumar"
  ],
  "Tracks": [
    "",
    "Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Attacks on Identity and access systems are starting points for major data breaches achieved through privilege escalation and lateral movement. Identity-threat hunting reduces time needed to detect traces of an attacker so that the consequences of a breach can be controlled. Identity-threat hunting involves data collection from identity providers, normalization and application of analytics while navigating the rabbit holes of authentication flows across the systems. Kestrel is a threat hunting language that accelerates cyber threat hunting by providing a layer of abstraction to build reusable, composable, and shareable \"hunt-flows\", providing a great platform for identity-threat hunting.\n\n\nThis arsenal session will showcase identity-threat hunting built on top of Kestrel. Starting with federated data retrieval from IAM systems using the OASIS Structured Threat Information eXpression (STIX) standard via OCA's STIX-shifter and lifting the results into an entity-relational data model. Then we will showcase analytic hunt steps besides data retrieval steps, walking you through the use case to hunt malicious activity in login data.\n\n\nTo showcase the capability of kestrel and identity threat hunting, we use event data gathered from IBM Security Verify Identity and access management (IAM). The queries and analysis follow OASIS STIX standards. Our hunt book will work with any Identity provider that has a stix-shifter connector.\n\n\nThe showcase uses a search for the IP address with multiple failed logins and later drills down and correlates with threat intel of known malicious activity for those IP addresses. The demo will also showcase the geographical distribution of those suspicious IP addresses, a list of applications which are accessed by these compromised IP addresses and accounts details of the logged-in user by IP address.\n\n\nMaking it ready to try by the audience, we will demonstrate live hunts in Jupyter Notebooks. At the end of the session, we will introduce the kestrel-huntbook repo for people to reuse existing huntbooks and share their hunting knowledge with their colleagues and other hunters in the community",
  "Year": "2023",
  "Location": "USA"
}