{
  "Tool Name": "Introducing varc: Volatile Artifact Collector",
  "Speakers": [
    "Chris Doman",
    "Matt Muir"
  ],
  "Tracks": [
    "Track:"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Varc (https://github.com/cado-security/varc) is a recently-released\nopen source volatile artifact collection tool.\n\nDriven by a philosophy of simplicity and reliability, the tool was\ndeveloped to aid investigation of security incidents, and is available\nto the community under a friendly licence. Varc achieves this by\ncollecting a snapshot of volatile data from a system and outputting it\nas JSON - so that it can easily be ingested by another parser or read\nby a human investigator.\n\n\nVarc’s design philosophy has an emphasis on portability, meaning that\nit can run across operating systems, in cloud and on-premise\nenvironments – and also supports serverless artifact collection.\n\n\nAnd if there is a demo talk requirement:\n\nIn this talk, Matt Muir, Threat Intelligence Researcher, Cado Security\nand Chris Doman, CTO Cado Security will discuss the motivation for\ndeveloping varc. They’ll also cover the technical challenges inherent\nto volatile artifact collection in serverless environments and across\noperating systems. Finally, they’ll give a live demonstration of varc\nand show the audience how it can be used to aid incident response.\n\n\nDescription\nThe talk will be divided into the following 4 sections:\n1) Background and Motivation\n2) Technical Challenges\n3) varc Demonstration\n4) Conclusion\n\n\nBackground and Motivation\nMatt and Chris will begin the talk with some discussion of what\nexactly varc is and an overview of its features. They’ll then move\non to discuss the reason for Cado Security’s development of this tool\nand what problems varc addresses, when compared with other volatile\ncollection tools. Some background to varc’s design philosophy will\nalso be provided.\n\n\nTechnical Challenges\nIn this section, Matt and Chris will discuss the various technical\nchallenges that working with volatile data presents. This will include\nan overview of which artifacts were deemed important to an incident\nresponder and how these can be accessed via Python code on the various\noperating systems varc supports. There will also be some discussion on\nhow varc operates in serverless environments and what this means for\ninvestigators working in this area.\n\nvarc Demonstration\nThis section will include a demonstration of varc on a system where\nsome malicious activity has occurred. Matt and Chris will highlight\nartifacts of interest and demonstrate varc’s extraction and\npresentation of these to the audience.\n\n\nConclusion\nThe talk will conclude with discussion about how varc is integrated\ninto Cado and how this benefits users of the platform. Matt and Chris\nwill also discuss the potential for further work in this area and\nprovide the audience with details of how they can get involved.\nFinally, a Q&A session will give the audience an opportunity to have\nany questions about varc answered.",
  "Year": "2023",
  "Location": "USA"
}