{
  "Tool Name": "T3SF (Technical TableTop Exercises Simulation Framework)",
  "Speakers": [
    "Federico Pacheco",
    "Joaquin Lanfranconi"
  ],
  "Tracks": [
    "Data Forensics/Incident Response",
    "Human Factors"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "T3SF is a framework that offers a modular structure for the orchestration of events from a master scenario events list (MSEL) together with a set of rules defined for each exercise and a configuration that allows defining the parameters of the correspondent platform. The main module performs the communication with the specific module (Discord, Slack, Telegram, WhatsApp, Teams, etc.) which allows the events to be presented in the input channels as injects for each platform. Also, the framework supports different use cases: single organization-multiple areas, multiple organization-single area, and multiple organization-multiple areas. It has been successfully tested in exercises with international companies, which allowed us to validate its commercial level.\n\nTabletop exercises have 2 approaches: traditional (scenarios with discussion) and modern (automatic events on a platform). The 1st platform was funded by the DHS (USA) with USD20 MM over 10 years. In 2021 we proposed a novel approach using free collaborative platforms, which allowed the development of a free and open source framework.\n\nThe original research paper presented and published at the IEEE ARGENCON 2022 academic congress, under the title \"Cybersecurity Incident Response Simulation for Organizational and Classroom Learning.\" (preprint available at IEEE TechRxiv).\n\nThe tool itself was first presented and released in the most important cybersecurity conference in Spain (RootedCon 2022) and then updated and presented in the most important cybersecurity conference in Latin America (Ekoparty 2022, video available on YouTube). Then it was presented at FIRST Technical Colloquium Amsterdam 2023 (April) and BlackHat Asia Arsenal 2023.\n\nThis version is a major update that includes new features like a better GUI frontend for configuration and scenario setup, an automatic inject creation engine based on a given set of parameters (design decisions) and real time interactions based on ChatGPT predefined prompts.",
  "Year": "2023",
  "Location": "USA"
}