{
  "Tool Name": "BTA: An Open-Source Active Directory Security Audit Framework",
  "Speakers": [
    "Joffrey Czarny"
  ],
  "Tracks": [
    "Track: Data Forensics/Incident Response"
  ],
  "Event": "BH-ASIA-16",
  "Github URL": "https://github.com/adulau/hack-lu-website/blob/master/agenda/index.md",
  "Description": "When it comes to the security of the information system, Active Directory domain controllers are, or should be, at the center of concerns, which are (normally) to ensure compliance with best practices, and during a compromise proved to explore the possibility of cleaning the information system without having to rebuild Active Directory. Indeed, backdoors can be implemented in Active Directory to help an intruder to gain back his privileges. However, few tools implement this cleaning/survey process despite several ways existing for backdooring Active Directory.We propose to present some possible backdoors which could be set by an intruder in Active Directory to keep administration rights. For example, how to modify the AdminSDHolder container in order to reapply rights after administrator actions. Then, we will present BTA, an audit tool for Active Directory databases, and our methodology for verifying the application of good practices and the absence of malicious changes in these databases. One of example, that we will show, is how to spot accounts which have DCSync rights and pulls account credentials through the standard Domain Controller replication API.The presentation will be organized as follows:We begin by describing the stakes around the Active Directory, centerpiece of any information system based on Microsoft technologies.We will continue by demonstrating some backdoors in order to keep admins rights or to help an intruder to quickly recover admins rights.We will present BTA and the methodology developed to analysis Active Directory.We conclude with a feedback on real world usage of BTA.More information can be found on the Bitbucket repository: https: //bitbucket.org/iwseclabs/bta",
  "Year": "2016",
  "Location": "Asia"
}