{
  "Tool Name": "Remote Assessment and Proctoring using Intelligent Devices (RAPID)",
  "Speakers": [
    "Weihan Goh",
    "Kin Ping Tse",
    "Jasmin Yi Yap",
    "Jubilian Hong Yi Ho",
    "Daniel Zhonghao Tan",
    "Muhamed Fauzi Bin Abbas",
    "Arthur Wee Yeong Loo"
  ],
  "Tracks": [
    "Internet of Things",
    "Hardware/Embedded"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Many educational institutions have adopted online proctoring as a mean to conduct and ensure academic integrity during online assessments, spurred by the pandemic. Most of such remote assessment solutions are closed-source, and requires the installation of various libraries or dependencies; this introduces potential risk for students who would not be able to scrutinize, or have a say as to what is installed on their computers. Being closed source, such solutions can also be slow to react to mala fide actions to tamper and bypass measures put in place to deter cheating. In fact, one only needs to perform cursory searches online to find various ways to defeat some well-known closed-source remote assessment solutions.\n\nTo tackle the issue at hand, we introduce a proof of concept, open-source system for remote proctoring that does not require prior installation of any software or libraries. It leverages the Raspberry Pi Zero hardware that is programmed to inject fileless scripts into a Windows system to monitor surface level and internal activities during remote assessments. To deter mala fide attempts to tamper with our solution, we incorporate techniques typically used by malware and C2 infrastructure in the development of our solution, with the ultimate goal of using such techniques for good. Hence at the end of each proctoring session, our solution leaves no trace of its presence or any residue within the proctored environment.\n\nBeing a proof-of-concept, we envision extending our solution to support other popular operating systems, as well as capture and analyze more data with greater efficiency.",
  "Year": "2022",
  "Location": "Europe"
}