{
  "Tool Name": "Weapons of Office Destruction: Prevention with Machine Learning",
  "Speakers": [
    "Jason Zhang",
    "Felipe Ducau"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "The broad-brush popularity of Microsoft (MS) Office documents led them to become one of the main cyber-attacking vectors to spread malware via email attachments or web downloads. The first major outbreak of its kind is the notorious macro-based malware \"Melissa\" during the turn of last century and this century. Since 2014 we started to see rising weaponized Office documents, particularly visual basic application (VBA) macro-based attacks (banking Trojan like \"Dridex\" or ransomware such as \"Locky\"). According to a Sophos report in 2017, over 80% of document-based malware were delivered via MS Word or Excel files. Even though these attacks are not new in nature, the increasing volume and complexity of the attacks impose huge challenges to traditional signature-based anti-virus (AV) products.\n\nAs a countermeasure, AV companies have spent an enormous amount of effort creating heuristic rules over decades for signature-based detection. To better leverage the rules already used in traditional AV solutions, we propose to combine them statistically using a simple random forest-based machine learning (ML) classifier. In this demonstration, a comprehensive list of over 3000 existing heuristic rules is used to train the ML model. The training data feed comprises around 92600 real-world benign and malicious MS Office documents including Word, Excel and PowerPoint file formats. The testing datasets include 17929 malicious files and 12511 benign files collected recently. Evaluation results indicate that the proposed approach exhibits enhanced performance and significantly outperforms eleven well known commercial anti-virus scanners with a much higher true positive rate (TPR) of 98.46% achieved while maintaining a low false positive rate (FPR) of 0.33%. Of the evaluated commercial AV scanners, the best one achieves only a TPR of 87.5%, which is more than 10% lower than the proposed ML model.",
  "Year": "2019",
  "Location": "Asia"
}