{
  "Tool Name": "CROZONO Framework: Leveraging Autonomous Devices as an Attack Vector on Industrial Networks",
  "Speakers": [
    "Sheila Ayelen Berta",
    "Nicolas Villanueva"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-EU-16",
  "Github URL": null,
  "Description": "CROZONO is a framework that allows performing automated penetration tests from autonomous devices (drones, robots, etc.) that could ease the access to the logical infrastructure of an industrial facility, evading physical barriers. The CROZONO framework is presented in two versions: \"CROZONO Explorer\" and \"CROZONO Attacker.\"At first, it is advisable to use CROZONO Explorer, as it allows the user to perform information gathering about possible attack vectors on the whole industrial facility's perimeter or any other sector. The information gathered by CROZONO Explorer allows the user to see the location of WiFi Access Points and IP Cameras, together with their security levels. The purpose of this step is to find the easiest way to compromise the industrial facility's security. For example, attacking those WiFi access points which have the lowest security level, if any security measures at all.CROZONO Attacker is a smart framework, it has the capability of performing automated attacks targeted to a network, and to take decisions -without the need of the attacker's intervention- on which attacks to perform based on pre-established parameters and the information gathered about its target. The goal of CROZONO Attacker is to breach the network attacking a WiFi access point and then opening a reverse connection to the attacker via the victim's internet connection. Once performed, CROZONO Attacker allows - through its \"LAN discovery\" and \"LAN Attacks\" modules - to discover other devices in the target network and launch several attacks on it.One of the best exclusive features of CROZONO is the report generation about all information gathered. In few minutes, it is possible to explore a zone or an industrial facility's perimeter and know its weak points from the summarization of data captured visually, allowing to see its security exposure levels.",
  "Year": "2016",
  "Location": "Europe"
}