{
  "Tool Name": "Haaukins: A Highly Accessible and Automated Virtualization Platform for Security Education",
  "Speakers": [
    "Jens Myrup Pedersen"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Haaukins is a highly accessible platform for security education, which allows users to try out ethical hacking and penetration testing using Kali Linux through a browser. It makes it possible to conduct trainings for even large groups without the need for installing virtual environments or other tools – the participants can work on their own laptops just through their web browser of choice, and have access within a couple of minutes.\n\nHaaukins allows the teacher/instructor to set up an event using a command line interface specifying e.g. which challenges to include and how many labs are needed. Labs can include different kind of challenges, such as a number of vulnerable machines. The challenges can also include e.g. sniffing network traffic between different machines. Once an event is setup, users/teams can easily register and see the challenges as in any CTF.\n\nWhat makes Haaukins stand out is that each user is assigned a virtual lab, which is accessed through a Kali Linux accessible through a web browser. After registration, the user just clicks the \"connect\" button, and he can access the Kali Linux desktop.\n\nHaaukins is designed with training in mind rather than for competition. For this reason a number of features are implemented such as Dynamic Flags, so the teams cannot exchange flags between each other, and a randomization of IP addresses throughout the challenges, so teams really have to work their own way through.\n\nIt is easy to contribute with new challenges, since challenges can consist of any set of docker images and VirtualBox OVA's.\n\nDuring the last year, the platform has been tested out with different target audiences, including OWASP groups, networks of IT professionals, companies, high schools and higher education.",
  "Year": "2019",
  "Location": "Europe"
}