{
  "Tool Name": "TheTHE: The Thread Hunting Experience",
  "Speakers": [
    "David Garcia",
    "Pablo San Emeterio",
    "Sergio de los Santos"
  ],
  "Tracks": [
    "Track: OSINT - Open Source Intelligence"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/epavlick/turker-demographics/blob/master/dictionaries/qual-cutoff/0.50/dictionary.ilo",
  "Description": "TheTHE is an environment intended to help analysts and hunters over the early stages of their work in an easier, unified and quicker way. One of the major drawbacks when dealing with a hunting is the collection of information available on a high number of sources, both public and private.\n\nAll this information is usually scattered and sometimes even volatile.\n\nPerhaps at a certain point there is no information on a particular IOC (Indicator of Compromise), but that situation may change within a few hours and become crucial for the investigation.\n\nBased on our experience on Threat Hunting, we have created a free and open source framework to make the early stages of the investigation simpler from:\n\n- Automation of tasks and searches.\n\n- Rapid API processing of multiple tools.\n\n- Unification of information in a single interface, so that screenshots, spreadsheets, text files, etc. are not scattered.\n\n- Enrichment of collected data.\n\n- Periodic monitoring of a given IOC in case new information or related movements appear.\n\nTheTHE has a web interface where the analyst starts its work by entering IOCs that will be sent to a backend, where the system will automatically look up for such resource on the various configured platforms in order to obtain unified information from different sources and access related reports or data existing on them. Furthermore, any change in the resources to be analyzed will be monitored.\n\nEverything is executed on a local system, without needing to share information with third parties until such information is not organized, linked, complete and synthesized. This allows that in case the information must be analyzed on any other platform later (such as a Threat Intelligence Platform), it can be done in the most enriching possible manner.",
  "Year": "2019",
  "Location": "Europe"
}