{
  "Tool Name": "goKey: Reclaim Back Keys for Your Kingdom - A Vaultless Password Manager",
  "Speakers": [
    "Ignat Korchagin"
  ],
  "Tracks": [
    "Track: Cryptography"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "The password is the oldest and most widely used pillar of authentication. We use passwords everywhere: from everyday online shopping to accessing government services and managing our money. Every day, the number of online services increases and each of service most likely requires a password to use it.\n\nOn the other hand, as password-cracking techniques increase and evolve, so do the restrictions on the types of passwords we can use. It is not enough anymore to use your favourite movie as a password across all your accounts. The modern Internet threat model requires passwords to be either ridiculously long or look like random gibberish of uppercase and lowercase letters, numbers and special characters. And in NO WAY should you reuse same password on any two services. In other words, the most secure passwords are hardly memorable to ordinary people and the number of passwords you have to remember makes this task even harder.\n\nThat's where password managers kick in. Instead of remembering each password, you only have to remember the password for your password manager (the \"master password\"), and the password manager remembers your other passwords for you. But how? They store your other passwords in a vault (a simple encrypted database). However, as with any database, a vault requires management: you need to store it somewhere (which means more backups), sync it across all your devices (you definitely want to access your services from home/work laptops, smartphone, tablet etc). And as with any database management, there comes usability and security issues. Basically, you either have to manually update and manage the vault yourself (if you use a free open-source password manager) or rely on some kind of cloud-based service (often paid and proprietary) for that.\n\nSo it is a matter of usability vs security: either you're using a convenient proprietary password manager and have no idea if it is working as advertised, or you have more confidence in your open-source password manager, but have to deal with your vault yourself.\n\nWouldn't it be great to have a password manager without a vault? We would no longer have to manage vaults or rely on any third parties. This presentation introduces an open-source vaultless password manager, which does not store your passwords, but rather derives them from the master-password in a cryptographically secure manner. There is an option to generate secure cryptographic keys so that your passwords/keys are never stored anywhere, but can be reliably regenerated when needed.\n\n\nPresentation: https://drive.google.com/file/d/1B5CXRaTzG8yYTW6sN9L70GW3NBLpZVJb/view?usp=sharing\nGitHub: https://github.com/cloudflare/gokey",
  "Year": "2018",
  "Location": "Europe"
}