{
  "Tool Name": "iBombShell: Dynamic Remote Shell",
  "Speakers": [
    "Pablo Gonzalez Perez",
    "Álvaro Nuñez-Romero"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/Matir/jspassphrase/blob/master/wordlist.json",
  "Description": "The emergence of PowerShell within pentesting post-exploitation is important. Its flexibility, possibilities and power make this Microsoft´s command line an efficient post-exploitation tool. In scenarios where we cannot use neither install pentesting techniques this tool acquires special relevance. iBombShell gives access to a pentesting repository where the pentester could use any function oriented to the post-exploitation phase and, in some cases, exploit vulnerabilities. iBombShell is a remote pentesting Shell that loads itself automatically in memory offering unlimited tools for the pentester.\n\niBombShell is a tool written in PowerShell that allows post-exploitation functionalities in a shell or a prompt, anytime and in any operating system. Moreover, it allows, in some cases, the execution of vulnerability exploitation features. These features are loaded dynamically, depending on when they are needed, from a GitHub repository.\n\nThe shell is downloaded directly to memory giving access to many pentesting features and functionalities, avoiding any hard drive access. These functionalities downloaded to memory are in PowerShell function format. This execution strategy is called EveryWhere.\n\nIn addition, iBombShell allows a second way of execution called Silently. Using this execution way, an iBombShell instance (called warrior) can be launched. When the Warrior is executed over a compromised machine, it will connect to a C2 through the http protocol. From the C2, written in Python, a warrior can be controlled to dynamically load functions to the memory and to offer pentesting remote execution functionalities. All those steps are part of the post-exploitation phase.",
  "Year": "2018",
  "Location": "Europe"
}