{
  "Tool Name": "Real-Time AD Attack Detection: Detect Attacks Leveraging Domain Administrator Privilege",
  "Speakers": [
    "Wataru Matsuda",
    "Mariko Fujimoto",
    "Takuho Mitsunaga"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/0xe7/WonkaVision",
  "Description": "In Advanced Persistent Threat (APT) attacks, attackers tend to attack the Active Directory to expand infections. Attackers try to take over Domain Administrator privileges and create a backdoor called the \"Golden Ticket\". Attackers leverage this Golden Ticket to disguise themselves as legitimate accounts and obtain long-term administrator privilege. However, detecting attacks that use this method is quite difficult because the attackers' use of legitimate accounts and commands are not identified as anomalies.\n\nWe introduce a real-time detection tool that uses Domain Controller Event logs for detecting attack activities leveraging Domain Administrator privileges. Our tool can minimize the damages these types of attacks can cause even if the attackers maliciously take advantage of the Golden Ticket.\n\nOur tool consists of the following steps to reduce false detection rate and support immediate incident response.\n\nStep1 (Signature based detection): Analyze Event logs focusing on the characteristics of the attack activities.\nStep2 (Machine Learning): Use unsupervised machine learning and anomaly detection in order to detect suspicious commands that attackers tend to use as outliers.\nStep3 (Real-time alert): Raise real-time alerts using Elastic Stack if attack activities are detected.\n\nWe will publish our tool on GitHub and show specific algorithms that we have implemented so that visitors can customize or develop their own system. Our tool is all open sourced, enabling immediate and efficient incident responses against attacks at a reasonable cost.\n\nPresentation: ﻿https://github.com/sisoc-tokyo/Real-timeDetectionAD/blob/master/Arsenal_eu-18-Real-time-Detection-of-Attacks-Leveraging-Domain-Administrator-Privilege.pdf",
  "Year": "2018",
  "Location": "Europe"
}