{
  "Tool Name": "Blackdagger",
  "Speakers": [
    "Mahmut Erdem Ozgen",
    "Regaip Kurt",
    "Onurhan Erdogdu",
    "Ata Seren"
  ],
  "Tracks": [
    "Vulnerability Assessment",
    "Web AppSec"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Blackdagger represents a significant advancement, offering a comprehensive solution for orchestrating complex workflows in DevOps, DevSecOps, MLOps, MLSecOps, and Continuous Automated Red Teaming (CART) environments.\n\nAt its core, Blackdagger simplifies the management and execution of intricate workflows through its user-friendly approach and powerful functionality. Leveraging a declarative YAML format, Blackdagger enables users to define automation pipelines using a Directed Acyclic Graph (DAG), facilitating clear and concise expression of task dependencies and execution logic.\n\nWhat sets Blackdagger apart is its simplicity and versatility. Unlike traditional cron-based schedulers or workflow orchestration platforms, Blackdagger eliminates the need for extensive scripting or coding. With a built-in Web UI, users can easily manage, rerun, and monitor automation pipelines in real-time, streamlining the workflow management process. Additionally, Blackdagger offers native Docker support, enabling seamless integration with containerized environments, and a versatile toolset for task execution, including making HTTP requests and executing commands over SSH.\nBlackdagger stands out due to its comprehensive features aimed at simplifying and enhancing automation workflow management.\n\nHighlights of Blackdagger\n\n* Single binary file installation\n* Declarative YAML format for defining DAGs\n* Web UI for visually managing, rerunning, and monitoring pipelines\n* Use existing programs without any modification\n* Self-contained, with no need for a DBMS\n* Suitable for Continuous Red Teaming (CART)\n* Suitable for DevOps and DevSecOps\n* Suitable for MLOps and MLSecOps",
  "Year": "2024",
  "Location": "Europe"
}