{
  "Tool Name": "Clear NDR - Community",
  "Speakers": [
    "Peter Manev"
  ],
  "Tracks": [
    "Network Defense",
    "Network Attacks"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/ChanChiChoi/tiny-crawler/blob/master/paperMeta4arxiv/arxiv-0801.txt",
  "Description": "For the last decade, SELKS has been the go-to open source platform for network security professionals, combining Suricata's power with an all-in-one toolkit. Now, we're unveiling its revolutionary successor: Clear NDR™ - Community from Stamus Networks.\n\nThis isn't just an upgrade; it's a complete reimagining of what open source network security can be. We've rebuilt the platform from the ground up, focusing on:\n\nStreamlined User Experience: An intuitive interface that makes complex threat hunting and incident response accessible to both seasoned analysts and newcomers alike.\nCommercial-Grade Performance: Leveraging the architecture of our Stamus Security Platform, Clear NDR - Community delivers the speed and scalability required for modern, high-traffic networks.\nFeature Parity: Inherit many of the advanced features previously exclusive to our commercial platform, including\n100% Open Source Commitment: Clear NDR - Community remains completely free to use, modify, and distribute. We believe in the power of community collaboration to drive innovation in network security.\nIn this talk, Stamus Networks Co-Founder Peter Manev will dive into the technical details of Clear NDR - Community, showcasing its capabilities through real-world scenarios. We'll also discuss our vision for the future of open source network security and how you can get involved in shaping this exciting new platform.\n\nWhether you're a long-time SELKS user, a security enthusiast, or simply curious about the future of network defense, this session will provide a comprehensive introduction to Clear NDR - Community and its potential to transform the way you protect your networks.\n\nKey Takeaways:\n\nDiscover the key advancements in Clear NDR - Community compared to SELKS\nLearn how to leverage its powerful features for enhanced threat detection and response\nUnderstand the benefits of open source in the network security landscape\nGain insights into how you can contribute to and benefit from the Clear NDR - Community edition",
  "Year": "2024",
  "Location": "Europe"
}