{
  "Tool Name": "NAD - A Tool for Performing Dynamic Runtime Analysis of Android Functions",
  "Speakers": [
    "Han Lee"
  ],
  "Tracks": [
    "Track: Android, iOS and Mobile Hacking"
  ],
  "Event": "BH-ASIA-17",
  "Github URL": "https://github.com/MattPD/cpplinks/blob/master/analysis.dynamic.md",
  "Description": "Android application penetration testing goes further than testing the client to server communication. In order to get a holistic view on the risk exposure, a thorough analysis of the application has to be done to understand how the application works. This is also imperative to be able to bypass jailbreak detection, SSL pinning, or figure out how the application is handling encryption (e.g. being able to decrypt certain values).There are several approaches available:The application can be decompiled, modified and recompiled. This approach however may not always work due to errors while decompiling.Patch the application by utilizing method hooks and overriding the original method. In order to identify the correct code and method to patch, the penetration tester has to go through the very time consuming process of figuring out the correct methods.Adding to the frustration, most applications in release mode produce minified and obfuscated code. The above-mentioned problems makes analyzing an Android application a very tedious process, even before the actual analysis of the application has started. Currently there are no tools available for Android that allow for easy method hooking. This is why I started developing NAD, a tool which allows testers to perform on the fly method hooks.This talk aims to demonstrate an Android tool built upon the Xposed framework. This tool is an attempt to be the \"Burp suite\" for Android application methods. It provides the user with several abilities to ease such frustration and make life easier:Perform trace method callsIntercept all methods of the Android applicationPause the applicationModify the input parameters of the hooked methodModify the return value of the hooked methodMy goal for developing this tool is to save time and provide more insight into compiled Android applications.DOWNLOAD: https://github.com/HanLee/Not-a-debugger",
  "Year": "2017",
  "Location": "Asia"
}