{
  "Tool Name": "OWASP Seraphimdroid",
  "Speakers": [
    "Ade Yoseman Putra"
  ],
  "Tracks": [
    "Track: Android, iOS and Mobile Hacking"
  ],
  "Event": "BH-ASIA-17",
  "Github URL": "https://github.com/OWASP/PageCreator/blob/master/all_leaders.csv",
  "Description": "Indonesia is undoubtedly one of the most attractive markets in Southeast Asia. With a population of over 250 million - the largest in the region and the fourth largest in the world, after China, India, and the US - who wouldn't keep an eye on this market?According to We Are Social's compendium of world digital stats, Indonesia now has 88.1 million active internet users, up 15 percent over the past 12 months. Its mobile market has exploded over the past couple of years. SIM subscriptions in Indonesia stand at 326.3 million, way more than its population. This means each mobile phone user owns an average of two SIM cards. 85 percent of the population own mobile phones, while 43 percent carry smartphones.Mobile apps offer a level of convenience that the world has never known before. From home, the office, on the road and even from the hotel room in another country on vacation - can login to any voicemail at work, check the credit card balance, view the bank balance, buy new clothes, book travel and more. This extreme level of convenience has brought with it an extreme number of security risks as user's credit card details, bank logins, passwords and more are flying between devices and backend databases and systems across the net. Understanding these risks can help many people prepare their app and protect, their data and their users.OWASP Seraphimdroid is a privacy and security protection app for Android devices. It enables users to protect their devices against malicious software (viruses, trojans, worms, etc.), phishing SMS, MMS messages, execution of dangerous USSD codes, theft and loosing. Also, it enables user to protect their privacy and to control the usage of applications and services via various kinds of locks.",
  "Year": "2017",
  "Location": "Asia"
}