{
  "Tool Name": "EKTotal",
  "Speakers": [
    "Keita Nomura",
    "Rintaro Koike"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "\"EKTotal\" is an integrated analysis tool that can automatically analyze the traffic of Drive-by Download attacks. The proposed software package can identify four types of Exploit Kits such as RIG and Magnitude, and more than ten types of attack campaigns such as Seamless and Fobos. EKTotal can also extract exploit codes and malware. The proposed heuristic analysis engine is based on Exploit Kit tracking research conducted since 2017, and is known as team \"nao_sec\". EKTotal provides a user-friendly web interface and powerful automated analysis functions. Thus, EKTotal can assist SOC operators and CSIRT members and researchers.\n\nDrive-by download attacks are still actively conducted. Such attacks are continually changing and becoming more complex. At the beginning of 2017, attack campaigns targeting compromised websites were widespread. However, majority of the current attack campaigns are based on malvertising. Furthermore, in March 2018, several Exploit Kits began to exploit the critical vulnerability named CVE-2018-4878, which in turn is a significant threat. Various tools are available for analyzing malicious traffic. However, it's necessary to employ a combination of such tools or possess their knowledge for analyzing malicious traffic. Hence, EKTotal has been developed for conducting security analysis in a simplified manner.\n\nEKTotal is an all-in-one malicious traffic analysis and processing tool that functions by submitting files of \"pcap\" or \"saz\" format. After identifying the attack campaign and associated Exploit Kit through multiple filters, EKTotal extracts the obfuscated exploit code from the traffic data, deobfuscates it, and decrypts the encrypted malware. For example, in the case of RIG Exploit Kit, EKTotal deobfuscates multiple obfuscated JavaScript codes, extracts all exploit codes and malware decryption keys, and thereby decrypts the malware encrypted with RC4.",
  "Year": "2018",
  "Location": "USA"
}