{
  "Tool Name": "MLSploit: Resilient ML Platform - Advanced Deep Learning Analytic Platform Made Easy for Every Security Researcher",
  "Speakers": [
    "Evan Yang",
    "Li Chen"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Deep learning (DL) and machine learning (ML) had been proved to be effective tools to analyze or detect malware. To help security experts to apply cutting-edge ML technologies effortlessly, we designed a large scale DL analytic platform uniquely for security researches. This platform has a ML pipeline web interface which can guide users through each pipeline steps. Its novel feature analysis tool enables feature study and manipulation for adversarial ML evasive attack. The performances of classifiers can be compared and optimized and then used for prediction. The RESTful interface of this platform was developed to enable connections between external applications. Also it is possibly to productize this platform to become an cloud service.\n\nSecurity analyst can upload either static or dynamic malware dataset to storage, i.e. big data Hadoop file system, and start the analysis. Or if backend sandbox is hooded, binaries can be uploaded for processing and then apply the output for inference. The ML pipeline supports several popular open source libraries, such as Scikit-Learn, big data Spark ML and deep learning Keras/Theano/Tensorflow. The slow DL training can be accelerated in a loosely connected backend worker, such as Intel Xeon Phi or GPGPU machines. The outputs are presented at web pages in several tables or in 2-D or 3-D interactive JavaScript diagrams for clear visualization. All the outputs, such as feature coefficient etc., can be downloaded for other usages. Also the prediction page can be used for ensemble inference or extended to be a test bed to demo new algorithm or adversarial attacks and defences. We will demo ransomware analysis on this platform and the perturbation attack against pre-trained image convolution neural network classifiers. We believe via this platform the security researches and analysis can be accelerated greatly.",
  "Year": "2018",
  "Location": "USA"
}