{
  "Tool Name": "Cloud Log Fast Forensics with Yamato Security's Suzaku",
  "Speakers": [
    "Zach Mathis",
    "Fukusuke Takahashi",
    "Akira Nishikawa"
  ],
  "Tracks": [
    "Track: Cloud Security"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Suzaku (朱雀) is an open-source cloud threat hunting and log analysis tool designed to enhance AWS and Azure security investigations. Developed by Yamato Security, Suzaku brings blazing-fast detection, forensics, and triage capabilities to cloud environments, helping security teams uncover malicious activity, misconfigurations, and threats within cloud logs.\n\nInspired by the success of Hayabusa for Windows Event Logs, Suzaku applies the same powerful threat detection approach to cloud environments, leveraging Sigma-based rules to detect attacker techniques in AWS and Azure logs. Suzaku helps defenders quickly process massive cloud log datasets, enabling quick detection and forensic analysis for incident response and proactive threat hunting.\n\nKey Features:\n\n- Multi-cloud support – Works with AWS and Azure logs.\n- High-speed log processing – Parses large-scale cloud logs efficiently, reducing detection time.\n- Sigma rule integration – Uses community-driven and custom detection rules for cloud-specific attack techniques.\n- Forensic timeline generation – Maps attacker actions for incident response and DFIR investigations.\n- Lightweight and extensible – CLI-based, with JSON and CSV output for easy integration into SIEMs and SOAR tools.\n- Detection of cloud-specific threats – Identifies misconfigurations, privilege escalations, API abuses, persistence mechanisms, and unusual user activity.\n\nAs cloud threats continue to evolve, Suzaku provides security teams with a flexible, scalable, and powerful tool for detecting compromised cloud accounts, adversary tactics (MITRE ATT&CK for Cloud), and suspicious API calls.\n\nAttendees at Black Hat Arsenal will get an in-depth look at Suzaku's cloud security capabilities, including real-world case studies, live threat detection demonstrations, and new features for cloud-native investigations.",
  "Year": "2025",
  "Location": "USA"
}