{
  "Tool Name": "Glato: GitLab Attack Toolkit",
  "Speakers": [
    "Elgin Lee",
    "Matthew Jackoski",
    "John Stawinski",
    "Mason Davis"
  ],
  "Tracks": [
    "Track: Exploitation and Ethical Hacking"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "CI/CD pipelines are a too often overlooked aspect of the attack surface for many large organizations. Recent tooling has enabled engineers, researchers, and attackers to search GitHub for CI/CD vulnerabilities, but other DevOps platforms, like GitLab, have been left underserved.\n\nGlato (GitLab Attack Toolkit) is an enumeration and attack framework that empowers both blue and red teamers in identifying and exploiting vulnerabilities within GitLab instances.\nGlato works across all GitLab environments, including GitLab CE, EE, and GitLab Cloud. The tool is field-tested, having identified attack paths to GitLab Admin, Domain Admin, and Cloud Admin in multiple engagements with real Fortune 500 organizations.\n\nGitLab's CI/CD ecosystem can contain configuration vulnerabilities that expose organizations to token privilege escalation, sensitive data exposure, and arbitrary code execution on self-hosted runners. Glato's enumeration module leverages a personal access token or session cookies to systematically map all accessible repositories, groups, and instance-level resources. Through recursive pipeline workflow analysis, it identifies misconfigurations and vulnerable CI/CD pipelines that create attack paths within and beyond the GitLab environment.\n\nSecurity practitioners can deploy Glato's attack module to securely exploit these misconfigurations with features including encrypted variable exfiltration via Poisoned Pipeline Execution (PPE) attacks, secrets dumping, and self-hosted runner compromise. The tool's architecture ensures auditability and operational security through selective targeting and clean exfiltration methods.\n\nGlato has already been used in secure assessments and Red Team engagements to escalate privileges and compromise entire cloud environments.\n\n\nKey Features:\n1. Token/Cookie Authentication Analysis: Evaluates permissions and scope of GitLab tokens or session cookies\n2. Comprehensive Enumeration: Discovers accessible projects, groups, and resources with their permission levels\n3. Branch Protection Analysis: Identifies misconfigurations that could lead to code execution\n4. Secret Discovery: Enumerates secrets from multiple sources, including CI/CD variables\n5. Runner Enumeration: Identifies potentially accessible self-hosted runners\n6. Poisoned Pipeline Execution: Enables secure CI/CD pipeline exploitation with encrypted secrets exfiltration\n7. Quality-of-Life Features: Proxy support, SSL verification control, request throttling, cookie-based authentication for SSO environments, and detailed reporting options\n\nGlato provides security professionals with a systematic approach to evaluate GitLab environments and identify CI/CD pipeline risks before malicious actors can exploit them.",
  "Year": "2025",
  "Location": "USA"
}