{
  "Tool Name": "RansomWhen??? I Never Even Noticed It…",
  "Speakers": [
    "Bleon Proko Bleon Proko"
  ],
  "Tracks": [
    "Track: Cloud Security"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "A successful ransomware attack is the culmination of numerous steps performed by a determined attacker: gaining initial access to the victim's environment, enumerating privileges to identify sensitive data, escalating privileges to gain access to the identified data, and finally encrypting the original data before demanding the ransom payment (with the optional exfiltration step beforehand if an extortion play is on the table).\n\nThe encryption process itself is straightforward. After the data is accessed, a cryptographic key (usually an asymmetric key) is used to encrypt the original data, rendering the data unrecoverable by any identity not possessing the key. If the attacker first downloads the data to be used as a potential extortion leverage during the ransom process, this requires attacker-controlled infrastructure to support this data transfer and storage outside the victim's environment, all while attempting to evade any potential outbound data transfer alerting mechanisms in the target's environment.\n\nWhat if this was not necessary and the attacker could simply use the victim's own infrastructure while nullifying them any access to the data? Creativity is key when discovering new ways to attack a target, achieving a goal with little detection while using the least amount of resources.\n\nPermiso's P0 Labs research team identified several ways to abuse features allowed by AWS KMS (Key Management Service) to encrypt data on a target's buckets as part of a ransomware attack. This blog will touch upon detection opportunities that might help defenders mitigate these attack vectors through the help of RansomWhen, a new open-source tool we are releasing to aid all organizations in detecting usage of these ransomware TTPs in CloudTrail logs and enumerating identities that possess specific combinations of privileges corresponding to these TTPs.",
  "Year": "2025",
  "Location": "USA"
}