{
  "Tool Name": "StegoScan",
  "Speakers": [
    "Luke Bower"
  ],
  "Tracks": [
    "Track: Digital Forensics"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Bad actors have long used hidden information in many forms, for malicious purposes, continuously evolving their methods over time. To counter these threats, our detection software must also evolve, ensuring effective identification and mitigation. Heading these threats is stenography, the practice of concealing messages or content within other non-suspicious data. Previously steganography detection tools have focused on limited sets of file types at a surface level and require manual processing leading to unknown extents of undetected illicit content, and potentially wasteful labor. Which is why a better solution had to be developed: StegoScan.py is a powerful, next-generation tool that automates steganography detection in websites, web servers, and local directories, by integrating AI-driven object and deep file text recognition analysis. StegoScan.py is a comprehensive tool that is capable of scanning and scraping websites across a broad range of formats simultaneously with deep file extraction.\n\nThe tool boasts website and web server scanning capabilities, making it invaluable for security researchers monitoring illicit data exchanges or law enforcement tracking cybercriminals. A single command can analyze entire domains or IP ranges, retrieving and inspecting suspicious media and documents for hidden communications. Whether it's detecting covert exchanges in dark web marketplaces, identifying embedded propaganda in misinformation campaigns, or revealing concealed instructions within terrorist networks, StegoScan.py offers visibility into steganographic threats. Stegoscan.py integrates numerous AI models that enhance text detection by overcoming the former challenges of noise, distortions, and unconventional fonts, allowing forensic analysts, cybersecurity professionals, and law enforcement agencies to extract text from compromised media with increased confidence.\n\nBy combining multiple steganalysis techniques into a toolkit, StegoScan.py provides a detailed and multi-layered analysis of files, offering security teams, digital forensics experts, and cybersecurity researchers a cutting-edge solution to an evolving digital threat. As steganography techniques become more sophisticated, traditional tools fall short—StegoScan.py ensures organizations stay ahead of bad actors by detecting what others miss. This is accomplished by automatically scanning websites, organizing tests, utilizing AI to remove the need for manual inspection, and combining many mainstream tools and tests to ensure detection across a wide range of files and steganography techniques. In testing, StegoScan was able to scan a website and find hidden messages embedded in an image that was embedded in a pdf linked to the original webpage. This shows the depth and abilities that this tool offers, whereas operating with a previously developed workflow the user would have had to download the PDF manually, extract the suspected images and then run individual tests to uncover the stenography.",
  "Year": "2025",
  "Location": "USA"
}