{
  "Tool Name": "Windows Fast Forensics With Yamato Security's Hayabusa",
  "Speakers": [
    "Zach Mathis",
    "Fukusuke Takahashi",
    "Akira Nishikawa"
  ],
  "Tracks": [
    "Track: Digital Forensics"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Hayabusa (隼) is an advanced open-source threat hunting and log analysis tool designed to accelerate Windows event log detection, triage, and investigation. Developed by Yamato Security, Hayabusa empowers defenders by providing a fast, efficient, and extensible approach to parsing, analyzing, and detecting malicious activity within Windows Event Logs (EVTX).\n\nUnlike traditional SIEM-based detection methods, Hayabusa is lightweight, command-line-driven, and optimized for both real-time and forensic analysis. The tool utilizes an extensive library of Sigma-based detection rules to identify threats, ensuring analysts can quickly surface malicious behaviors, persistence mechanisms, lateral movement, and other suspicious activity.\n\nSecurity teams, forensic investigators, and threat hunters can leverage Hayabusa to process large-scale event log data at high speed, providing deep visibility into endpoint activity without relying on complex log ingestion pipelines. Whether used for incident response, DFIR investigations, or proactive threat hunting, Hayabusa delivers a practical, efficient, and highly adaptable solution for defenders.\n\nKey Features:\n\n- Blazing-fast Windows event log parsing – Processes large EVTX datasets efficiently.\n- Sigma rule integration – Detects attacker behavior based on a robust rule set.\n- Forensic timeline creation – Extracts key forensic artifacts for investigations.\n- Portable and lightweight – CLI-based tool with minimal dependencies.\n- Cross-platform support – Runs on Windows, Linux, and macOS.\n- JSON & CSV output formats – Easily integrates with existing security workflows.\nAs a community-driven and actively maintained tool, Hayabusa continues to evolve, offering cutting-edge detections for emerging threats, including APT activity, ransomware, and LOLBins (Living Off the Land Binaries).\n\nAttendees at Black Hat Arsenal will get an exclusive deep dive into Hayabusa's threat hunting capabilities, new features, and real-world use cases for enhancing Windows log-based security investigations.",
  "Year": "2025",
  "Location": "USA"
}