{
  "Tool Name": "Hardsploit: Like Metasploit But For Hardware Hacking",
  "Speakers": [
    "Yann Allain"
  ],
  "Tracks": [
    "Track: Hardware / Embedded"
  ],
  "Event": "BH-EU-15",
  "Github URL": null,
  "Description": "Why we chose to create HardSploit: It is clear that something is needed to help the security community to evaluate, audit and/or control the level of security in embedded systems.HardSploit is a complete tool box (hardware & software), a framework which aims to:- Facilitate the auditing of electronic systems for industry 'security' workers (consultants, auditors, pentesters, product designers, etc.)- Increase the level of security (and trust!) of new products designed by the industryHardSploit Modules & Framework:Hardsploit is an all-in-one tool hardware pentest tool with software and electronic aspects. This is a technical and modular platform (using FPGA) to perform security tests on electronic communications interfaces of embedded devices.The main hardware security audit functions are:- Sniffer- Scanner- Interact- Dump memoryHardsploit's Modules will let hardware pentesters intercept, replay and/or send data via each type of electronic bus used by the hardware target. The level of interaction that pentesters will have depends on the features of the electronic bus.Hardsploit's Modules further enable you to analyze electronic bus (serial and parallel types), JTAG, SPI, I2C's, parallel addresses & data bus on chip.Assisted Visual Wiring Function:No more stress with that tremendous part of Hardware pen testing: You will know what needs to be connected and where!We integrated into the tool an assisted visual wiring function to help you connect your wires to the hardware target:- GUI will display the pin organization (Pin OUT) of the targeted chip.- GUI will guide you throughout the wiring process between Hardsploit Connector and the target- GUI will control a set of LEDs that will turn ON and OFF to easily let you find the right Hardsploit Pin Connector to connect to your targetThe software part of the project will help to conduct an end-to-end security audit and will be compatible (integrated) with existing tools such as Metasploit. We will offer integration with other APIs in the future.Our ambition is to provide a tool equivalent to those of the company Qualys or Nessus (Vulnerability Scanner) or the Metasploit framework but in the domain of embedded systems/electronics.",
  "Year": "2015",
  "Location": "Europe"
}