{
  "Tool Name": "Adversarial Threat Detector",
  "Speakers": [
    "Isao Takaesu"
  ],
  "Tracks": [
    "Track: Vulnerability Assessment"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/gyoisamurai/Adversarial-Threat-Detector",
  "Description": "In recent years, deep learning technology has been developing, and various systems using deep learning are spreading in our society, such as face recognition, security cameras (anomaly detection), and ADAS (Advanced Driver-Assistance Systems).\n\nOn the other hand, there are many attacks that exploit vulnerabilities in deep learning algorithms. For example, the Evasion Attacks are an attack that causes the target classifier to misclassify the Adversarial Examples into the class intended by the adversary. The Exfiltration Attacks are an attack that steals the parameters and train data of a target classifier. If your system is vulnerable to these attacks, it can lead to serious incidents such as face recognition being breached, allowing unauthorized intrusion, or information leakage due to inference of train data.\n\nSo we released a vulnerability scanner called \"Adversarial Threat Detector\" (a.k.a. ATD), which automatically detects vulnerabilities in deep learning-based classifiers.\n\nATD contributes to the security of your classifier by executing the four cycles of \"Detecting vulnerabilities (Scanning & Detection)\", \"Understanding vulnerabilities (Understanding)\", \"Fixing vulnerabilities (Fix)\", and \"Check fixed vulnerabilities (Re-Scanning)\".\n\n1. Detecting vulnerabilities（Scanning & Detection）\nATD automatically executes a variety of attacks against the classifier and detects vulnerabilities.\n\n2. Understanding vulnerabilities (Understanding)\nWhen a vulnerability is detected, ATD will generate a countermeasure report (HTML style) and a replay environment (ipynb style) of the vulnerabilities. Developers can understand the vulnerabilities by referring to the countermeasure report and the replay environment.\n\n3. Fixing vulnerabilities (Fix)\nATD automatically fixes detected vulnerabilities.\n\n4. Check fixed vulnerabilities (Re-Scanning)\nThe ATD checks fixed vulnerabilities of the fixed classifier.\n\nOur \"Adversarial Threat Detector\" will contribute greatly to keep your safety.",
  "Year": "2021",
  "Location": "Asia"
}