{
  "Tool Name": "Bringing the X86 Complete RE Experience to Smart Contract",
  "Speakers": [
    "ZiQiao Kong",
    "ChenXu Wu",
    "KaiJern Lau"
  ],
  "Tracks": [
    "Track: Reverse Engineering"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Currently there is more than 2 Trillion USD market cap for the crypto currency market, DeFi alone is more than 100 Billion. With the popularity of the DeFi market, smart contracts again become the playground of hackers and security researchers. Token \"robbery\" became the most problematic issue for both investors and crypto currency exchange.\n\nEthereum Virtual Machine (EVM) is still the most widely used architect to support the core of smart contracts such as Polkadot, EVM and soon Cardano blockchain. Emulators built around EVM are merely good for development purposes. Most of the EVM analysis engines are just debugging tools based on symbolic execution. Unfortunately, these engines are just simple tools that do not encourage and support us to develop tools on top of them.\n\nDuring Black Hat Asia, Arsenal 2021, we presented \"Qiling: Smart Analysis for Smart Contract\" [1] and explained the foundation of Qiling's EVM engine. In Blackhat USA Arsenal 2021, we would like to take this opportunity to demonstrate the full capabilities and tools that we build on top of the Qiling's EVM engine. That brings the complete traditional X86 reverse engineering experience to the smart contract space.\n\n- Real time EVM debugger, with step into, step over and memory stack modification capabilities\n- Full emulation of multi cross contract instrumentation\n- Ultra fast emulation with pre-set environment variable\n- Fully automated reapply and verify latest smart contract attack to all existing contract on a exchange or chain\n- Make symbolic execution to work with Qiling EVM engine to provide a more in depth emulation\n- Added a fully functional LLVM Intermediate Representation(IR). It allow a users to build a ultra fast fuzzer on-top of Qiling Framework.\n\nTo demonstrate the power of our framework and tools. We prepared some case study and demo on how we can rebuild the entire blockchain and verify the currently existing smart contract against the latest attack being discovered in the wild in the matters on few lines of code.\n\nOnce the talk ends, we will release the code and tools into the Qiling github repo, as usual.\n\nReferences:\n\n[1] Black Hat Arsenal 2021: https://www.blackhat.com/asia-21/arsenal/schedule/index.html#qiling-smart-analysis-for-smart-contract-22643",
  "Year": "2021",
  "Location": "USA"
}