{
  "Tool Name": "Cloud Sniper",
  "Speakers": [
    "Nicolás Rivero Corvalán",
    "Matías Marenchino",
    "Santiago Friquet",
    "Lucho Carranza Berra"
  ],
  "Tracks": [
    "Track: Malware Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Cloud Sniper is a platform designed to manage Cloud Security Operations, intended to respond to security incidents by accurately analyzing and correlating cloud artifacts. It is meant to be used as a Cloud Security Operations platform to detect and remediate security incidents by showing a complete visibility of the company's cloud security posture.\n\nIt introduces a centralized Incident and Response platform, which executes automatic actions, by learning from the analysts' expert knowledge. To do it, only native cloud artifacts and open source technologies are implemented. In this way, the community can extend the project with different security use cases.\n\nCloud Sniper receives and processes security feeds, providing an automatic response mechanism to protect the cloud infrastructure. To detect attackers' advanced TTPs, Cloud Sniper Analytics module correlates IOCs providing enhanced security findings to the security analyst.\n\nWith this platform, you get a complete and comprehensive management system of the security incidents. At the same time, an advanced security analyst can integrate Cloud Sniper with external forensic or incident-and-response tools to ingest new security feeds. The platform automatically deploys and provides cloud-based integration with all native resources, in a fully modularized manner, making it very easy to extend for the community.\n\nCloud Sniper introduces an analytics module to analyze data, metrics and telemetry generated on the cloud. This first version analyzes VPC flows to detect beaconing patterns.\n\nAs part of the platform, we have developed two modules to complement it:\n\n* Cloud Droid (Incident and Response Simulations): Currently, incident and response teams develop different mechanisms to detect attacks, leaving aside the testing phase. Although each automation is tested before implementation, it is not constantly monitored. Droid proposes an automated testing model in which controlled actions are expected to be triggered to perform security incident simulations.\n\n* Cloud Lusat (Internal Threat Intelligence Feeds, Inventory and Compliance Data Collection): It aims to process information based on threat intelligence feeds, generate an inventory and check the compliance of different cloud resources.",
  "Year": "2021",
  "Location": "USA"
}