{
  "Tool Name": "Introducing subCrawl: A Framework for the Analysis and Clustering of Hacking Tools Found Using Open Directories",
  "Speakers": [
    "Josh Stroschein",
    "Patrick Schläpfer"
  ],
  "Tracks": [
    "Track: Malware Offense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "From phishing kits to command-and-control panels, web shells and multiple samples of malware, open directories can provide a wealth of information into threat actor operations. But how can we discover open directories? And once we discover them, what are the next steps for identifying interesting content?\n\nTo answer these questions, we created the open-source framework subCrawl. subCrawl is written in Python3 and provides a modular framework for discovering open directories, unique content through signatures and organizing the data with optional output modules, such as MISP.\n\nOpen directories are simply folders that are viewable on a public web server that provides direct links to all its content. While open directories can be used to legitimately share files, they are often overlooked by threat actors. Therefore, they can provide insight into the structure, tools and malware being used by many threat actors. This oversight can provide direct access to the tools they've placed on a server, such as web shells, C2 panels or proxy scripts.\n\nTo organize the data, we use our framework subCrawl to aggregate the data with fuzzy hashes, web server information, used scripting languages and more. This approach allows for the creation of signatures that can be used to track tool usage across multiple hosts and cluster threat actor activities. To help manage the hosts explored and the data collected, we create consolidated MISP events, which enables us to cluster the found artifacts and draw interesting conclusions about the use of tools.\n\nWe will present the open-source framework subCrawl, which reflects our approach for hunting open directories. We will also explore our methodology to detect and cluster malicious content using publicly available threat feeds with the support of the well-known tool MISP, which helps us to store the data in a structured form and cluster it.",
  "Year": "2021",
  "Location": "USA"
}