{
  "Tool Name": "Slips: A Machine-Learning Based, Free-Software, Network Intrusion Prevention System",
  "Speakers": [
    "Sebastian Garcia",
    "Kamila Babayeva"
  ],
  "Tracks": [
    "Track: Network Defense"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": "https://github.com/stratosphereips/StratosphereLinuxIPS",
  "Description": "Slips is a behavioral-based intrusion prevention system, and the first free software to use machine learning to detect attacks in the network. It is a modular system that profiles the behavior of IP addresses and performs detections in time windows. Slips' modules detect a range of attacks both to and from the protected device. Slips connects to other Slips using P2P, and exports alerts to other systems.\n\nSlips works in several directionality modes. The concept of home network is not used to choose which detection to apply, but to choose which profile to analyze. The user can choose to detect attacks coming *to* or going *from* these profiles. This makes it easy to protect your network but also to focus on infected computers inside your network.\n\nAmong its modules, Slips includes the download/manage of external Threat Intelligence feed (including our laboratory's own TI feed), whois/asn/geocountry enrichment, a LSTM neural net for malicious behavior detection, port scanning detection (vertical and horizontal) on flows, long connection detection, etc. The decisions to block profiles or not are based on ensembling\nalgorithms. The P2P module connects to other Slips to share detection alerts.\n\nSlips can read packets from the network, pcap, Suricata, Zeek, Argus and Nfdump, and can output alerts files and summaries. Having Zeek as a base tool, Slips can correctly build a sorted timeline of flows combining all Zeek logs. Slips can send alerts using the STIX/TAXII protocol.\n\nMore importantly, the Kalipso Node.js interface allows the analysts to see the profiles' behaviors and detections performed by Slips modules directly in the console. Kalipso displays the flows of each profile and time window and compares those connections in charts/bars. It also summarizes the whois/asn/geocountry information for each IP that communicates with a protected device.",
  "Year": "2021",
  "Location": "USA"
}