{
  "Tool Name": "Unleash Purple Knight: Fend Off Invaders Lurking in Your Active Directory",
  "Speakers": [
    "Ran Harel"
  ],
  "Tracks": [
    "Vulnerability Assessment",
    "Data Forensics/Incident Response"
  ],
  "Event": "BH-ARSENAL",
  "Github URL": null,
  "Description": "Purple Knight is a free Active Directory (AD) and Azure AD security assessment tool developed by Semperis identity security experts that has been downloaded by 5,000+ users since its first release in spring 2021. Purple Knight runs as a standalone utility that queries the AD environment and performs a set of tests against many aspects of AD's security posture, including AD Delegation, account security, AD Infrastructure security, Group Policy security, and Kerberos security. The tool scans for indicators of exposure (IOEs) and indicators of compromise (IOCs). Each security indicator is mapped to security frameworks such as MITRE ATT&CK and the French National Agency for the Security of Information Systems (ANSII).\n\nPurple Knight produces a report that includes an overall score, scores in individual categories, and prioritized guidance from identity security experts that serves as a roadmap for improving overall security posture. The report includes an explanation of what aspects of the indicator were evaluated and the likelihood that the exposure will compromise AD.\n\nPurple Knight is continuously updated to address new security indicators based on original research and in response to emerging threats. As an example, the Purple Knight team released indicators for the Windows Print Spooler service and PetitPotam flaws within days after their discovery. New updates to be demonstrated at Arsenal include:\n• Newest in the 100+ indicators of exposure (IOEs) and indicators of compromise (IOCs)\n• New Azure Active Directory security indicators\n• Post-breach forensics capabilities that enable incident response teams to specify an attack window to accelerate remediation\n\nPurple Knight continuously evolves through feedback from an engaged community of users on the Purple Knight Slack channel and through individual outreach to users who communicate directly with the product teams.",
  "Year": "2022",
  "Location": "USA"
}